lin-dyn-sys-stanford.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Linear Dynamic Systems Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-09 03:56:11 EDT"/>
<meta name="author" content="Chris Beard"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Linear Dynamic Systems Notes</h1>

<p>Following notes from the <a href="file:///Users/FingerMan/Desktop/Engineering/kiet-ee-downloads/current/ee263_course_reader.pdf">EE263 Course Reader</a>. Orgmode &rarr; \LaTeXe
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left"><a href="http://www.stanford.edu/~boyd/ee263/matlab/">Matlab files</a></td><td class="left"><a href="file:///Users/FingerMan/Dropbox/AK-MBP/edu/systems/linear-algebra-notes.pdf">Linear Algebra</a></td></tr>
<tr><td class="left"><a href="file:///Users/FingerMan/Dropbox/AK-MBP/edu/systems/IntroToLinearDynamicalSys/index.html">Index</a></td><td class="left"></td></tr>
</tbody>
</table>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Lecture 2 </a>
<ul>
<li><a href="#sec-1_1">1.1 Interpretation for \(y=Ax\) </a></li>
<li><a href="#sec-1_2">1.2 Example in notes </a>
<ul>
<li><a href="#sec-1_2_1">1.2.1 Linear elastic structure </a></li>
<li><a href="#sec-1_2_2">1.2.2 Force/Torque on rigid body </a></li>
<li><a href="#sec-1_2_3">1.2.3 Thermal System </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Lecture 3 </a>
<ul>
<li><a href="#sec-2_1">2.1 Review of Linearization (affine approximation) </a>
<ul>
<li><a href="#sec-2_1_1">2.1.1 Good intuition range-finding problem </a></li>
</ul>
</li>
<li><a href="#sec-2_2">2.2 Intepretations of \(Ax=y\) </a>
<ul>
<li><a href="#sec-2_2_1">2.2.1 Computing \(C=AB\) </a></li>
<li><a href="#sec-2_2_2">2.2.2 Zero nullspace (in notes) </a></li>
<li><a href="#sec-2_2_3">2.2.3 Interpretations of nullspace </a></li>
<li><a href="#sec-2_2_4">2.2.4 Range </a></li>
<li><a href="#sec-2_2_5">2.2.5 Rank of matrix </a></li>
<li><a href="#sec-2_2_6">2.2.6 Various wrap-up items </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 Lecture 5 </a>
<ul>
<li><a href="#sec-3_1">3.1 Geometric properties of orthonormal vectors </a></li>
<li><a href="#sec-3_2">3.2 Orthonormal basis for \(\mathbb{R}^{n}\) </a></li>
<li><a href="#sec-3_3">3.3 Expansion in orthonormal basis </a></li>
<li><a href="#sec-3_4">3.4 Gram-Schmidt procedure </a></li>
<li><a href="#sec-3_5">3.5 \(QR\) decomposition </a></li>
<li><a href="#sec-3_6">3.6 General Gram Schmidt procedure (`rank revealing QR algorithm') </a></li>
<li><a href="#sec-3_7">3.7 Applications </a></li>
<li><a href="#sec-3_8">3.8 Least Squares Approximation </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Lecture 6 </a>
<ul>
<li><a href="#sec-4_1">4.1 Overdetermined equations </a></li>
<li><a href="#sec-4_2">4.2 Least Squares `Solution' </a></li>
<li><a href="#sec-4_3">4.3 Projection on \(\mathcal{R}(A)\) </a></li>
<li><a href="#sec-4_4">4.4 Orthogonality principle </a></li>
<li><a href="#sec-4_5">4.5 Least-squares via \(QR\) factorization </a></li>
<li><a href="#sec-4_6">4.6 Full \(QR\) factorization </a></li>
<li><a href="#sec-4_7">4.7 Applications for least squares approximations </a></li>
<li><a href="#sec-4_8">4.8 BLUE: Best linear unbiased estimator </a></li>
<li><a href="#sec-4_9">4.9 Range-finding example </a></li>
<li><a href="#sec-4_10">4.10 Quantizer example </a></li>
<li><a href="#sec-4_11">4.11 Least Squares data-fitting </a></li>
<li><a href="#sec-4_12">4.12 Least-squares polynomial fitting </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Lecture 7 </a>
<ul>
<li><a href="#sec-5_1">5.1 Least-squares polynomial fitting, cont'd </a></li>
<li><a href="#sec-5_2">5.2 Growing sets of regressors </a></li>
<li><a href="#sec-5_3">5.3 Least-squares system identification (important topic) </a></li>
<li><a href="#sec-5_4">5.4 Model order selection </a>
<ul>
<li><a href="#sec-5_4_1">5.4.1 Cross-validation </a></li>
</ul>
</li>
<li><a href="#sec-5_5">5.5 Growing sets of measurements </a></li>
<li><a href="#sec-5_6">5.6 Recursive ways to do least squares </a></li>
<li><a href="#sec-5_7">5.7 Fast update algorithm for recursive LS </a></li>
<li><a href="#sec-5_8">5.8 Multi-objective least squares </a></li>
</ul>
</li>
<li><a href="#sec-6">6 Lecture 8 </a>
<ul>
<li><a href="#sec-6_1">6.1 Plot of achievable objective pairs </a></li>
<li><a href="#sec-6_2">6.2 Minimizing weighted-sum objective </a></li>
<li><a href="#sec-6_3">6.3 Example: frictionless table </a></li>
<li><a href="#sec-6_4">6.4 Regularized least-squares </a></li>
<li><a href="#sec-6_5">6.5 Nonlinear least squares (NLLS) problem </a></li>
<li><a href="#sec-6_6">6.6 Gauss-Newton method for NLLS </a></li>
<li><a href="#sec-6_7">6.7 G-N example </a></li>
<li><a href="#sec-6_8">6.8 Underdetermined linear equations </a></li>
<li><a href="#sec-6_9">6.9 Least norm solution </a></li>
</ul>
</li>
<li><a href="#sec-7">7 Lecture 9 pt 2 </a>
<ul>
<li><a href="#sec-7_1">7.1 General norm minimization with equality constraints </a></li>
<li><a href="#sec-7_2">7.2 Autonomous linear dynamical systems </a></li>
<li><a href="#sec-7_3">7.3 Block diagrams </a></li>
<li><a href="#sec-7_4">7.4 Linear circuit example </a></li>
</ul>
</li>
<li><a href="#sec-8">8 Lecture 10 </a>
<ul>
<li><a href="#sec-8_1">8.1 Example: Series reaction \(A \rightarrow B \rightarrow C\) </a></li>
<li><a href="#sec-8_2">8.2 Discrete time Markov chain </a></li>
<li><a href="#sec-8_3">8.3 Numerical integration of continuous system </a></li>
<li><a href="#sec-8_4">8.4 Higher order linear dynamical systems (\(\dot x=Ax\)) </a></li>
<li><a href="#sec-8_5">8.5 Example: Mechanical systems </a></li>
<li><a href="#sec-8_6">8.6 Linearization near equilibrium point </a></li>
<li><a href="#sec-8_7">8.7 Example: pendulum linearization </a></li>
</ul>
</li>
<li><a href="#sec-9">9 Lecture 11 </a>
<ul>
<li><a href="#sec-9_1">9.1 Laplace transform </a></li>
<li><a href="#sec-9_2">9.2 Example: Harmonic oscillator </a></li>
<li><a href="#sec-9_3">9.3 Example: Double Integrator </a></li>
<li><a href="#sec-9_4">9.4 Characteristic polynomial </a></li>
<li><a href="#sec-9_5">9.5 Get eigenvalues of \(A\) and poles of resolvent </a></li>
<li><a href="#sec-9_6">9.6 Matrix exponential </a></li>
<li><a href="#sec-9_7">9.7 Time transfer property </a></li>
<li><a href="#sec-9_8">9.8 Application: sampling a continuous time system </a></li>
</ul>
</li>
<li><a href="#sec-10">10 Lecture 12 </a>
<ul>
<li><a href="#sec-10_1">10.1 Stability </a></li>
<li><a href="#sec-10_2">10.2 Eigenvectors and diagonalization </a></li>
<li><a href="#sec-10_3">10.3 Scaling intepretation </a></li>
<li><a href="#sec-10_4">10.4 Dynamic intepretation </a></li>
<li><a href="#sec-10_5">10.5 Invariant set </a></li>
<li><a href="#sec-10_6">10.6 Complex eigenvectors </a></li>
<li><a href="#sec-10_7">10.7 Dynamic interpretation: left eigenvectors </a></li>
<li><a href="#sec-10_8">10.8 Summary: </a></li>
<li><a href="#sec-10_9">10.9 Example- companion matrix </a></li>
</ul>
</li>
<li><a href="#sec-11">11 Lecture 13 </a>
<ul>
<li><a href="#sec-11_1">11.1 Example: Markov chain </a></li>
<li><a href="#sec-11_2">11.2 Diagonalization </a></li>
<li><a href="#sec-11_3">11.3 Not all matrices diagonalizable </a></li>
<li><a href="#sec-11_4">11.4 Distinct eigenvalues </a></li>
<li><a href="#sec-11_5">11.5 Diagonalization and left eigenvectors </a></li>
<li><a href="#sec-11_6">11.6 Modal form </a></li>
<li><a href="#sec-11_7">11.7 Real modal form </a></li>
<li><a href="#sec-11_8">11.8 Diagonalization simplification </a></li>
<li><a href="#sec-11_9">11.9 Simplify for analytical functions of a matrix </a></li>
<li><a href="#sec-11_10">11.10 Solution via diagonalization </a></li>
<li><a href="#sec-11_11">11.11 Interpretation </a></li>
<li><a href="#sec-11_12">11.12 Application </a></li>
<li><a href="#sec-11_13">11.13 Stability of discrete-time systems </a></li>
<li><a href="#sec-11_14">11.14 Jordan Canonical form </a></li>
</ul>
</li>
<li><a href="#sec-12">12 Appendix </a>
<ul>
<li><a href="#sec-12_1">12.1 Inverse, transpose properties </a></li>
<li><a href="#sec-12_2">12.2 Invertibility implications </a></li>
</ul>
</li>
<li><a href="#sec-13">13 Homework assignments </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Lecture 2 </h2>
<div class="outline-text-2" id="text-1">

<p><a href="file:///Users/FingerMan/Dropbox/AK-MBP/edu/systems/IntroToLinearDynamicalSys/materials/lsoeldsee263/02-lin-fcts.pdf">Official Lecture Notes</a>
</p>
</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Interpretation for \(y=Ax\) </h3>
<div class="outline-text-3" id="text-1_1">

<ul>
<li>
\(A\) a transformation matrix
</li>
<li>
\(y\) an observed measurement, \(x\) an unknown
</li>
<li>
\(x\) is input, \(y\) is output; for rows \(i\) and columns \(j\) in \(A\), \({\bf i \rightarrow y}\), \({\bf j \rightarrow x}\)
<ul>
<li>
indexed as \bf output, input
</li>
</ul>
</li>
<li>
Lower diagonal Matrix should make you expect or have a vague thought about causality.
<ul>
<li>
\(a_{ij}=0\) for \(i&lt;j \Rightarrow y_i\) only depends on \(x_1,...,x_i\) 
</li>
<li>
\(A\) is diagonal; output only depends on input
</li>
</ul>
</li>
<li>
Sparcity pattern (block of zeroes) in a matrix should have you wonder why&hellip;usually not coincidental
</li>
<li>
\(A_{35}\) positive \(\Rightarrow x_5\) increased corresponds to an increase in 3rd output, \(y_3\)
</li>
</ul>


</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> Example in notes </h3>
<div class="outline-text-3" id="text-1_2">


</div>

<div id="outline-container-1_2_1" class="outline-4">
<h4 id="sec-1_2_1"><span class="section-number-4">1.2.1</span> Linear elastic structure </h4>
<div class="outline-text-4" id="text-1_2_1">

<ul>
<li>
\(a_{11}\) probably positive
<ul>
<li>
\(x_1\) input gives positive push to \(y_1\) output
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-1_2_2" class="outline-4">
<h4 id="sec-1_2_2"><span class="section-number-4">1.2.2</span> Force/Torque on rigid body </h4>
<div class="outline-text-4" id="text-1_2_2">

<ul>
<li>
Net torque/force on body is linearly related to force inputs
</li>
</ul>


</div>

</div>

<div id="outline-container-1_2_3" class="outline-4">
<h4 id="sec-1_2_3"><span class="section-number-4">1.2.3</span> Thermal System </h4>
<div class="outline-text-4" id="text-1_2_3">

<ul>
<li>
despite normally needing a Poisson equation, the steady state heat of the different locations can be represented as a linear system \(Ax=y\)
</li>
</ul>


</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Lecture 3 </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Review of Linearization (affine approximation) </h3>
<div class="outline-text-3" id="text-2_1">


</div>

<div id="outline-container-2_1_1" class="outline-4">
<h4 id="sec-2_1_1"><span class="section-number-4">2.1.1</span> Good intuition range-finding problem </h4>
<div class="outline-text-4" id="text-2_1_1">

</div>
</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> Intepretations of \(Ax=y\) </h3>
<div class="outline-text-3" id="text-2_2">

<ul>
<li>
Scaled combination of columns in \(A\)
</li>
</ul>


<ul>
<li>
Looking at the rows: the multiplication is the inner product of rows and vector \(x\)
</li>
<li>
I/O ordering is backwards in control; in \(A_{ij}\), \(j\) refers to input and \(i\) refers to output
<ul>
<li>
indexing is likewise backwards in block diagram indexing
</li>
</ul>
</li>
</ul>




</div>
