lin-dyn-sys-stanford.html

<div id="outline-container-2_2_1" class="outline-4">
<h4 id="sec-2_2_1"><span class="section-number-4">2.2.1</span> Computing \(C=AB\) </h4>
<div class="outline-text-4" id="text-2_2_1">

<p>How to compute this faster than using formula \(c_{ij}=\sum_{k=1} A_{ik} B_{kj}\): have computer break it up into submatrices and do the multiplication on them
</p>
</div>

</div>

<div id="outline-container-2_2_2" class="outline-4">
<h4 id="sec-2_2_2"><span class="section-number-4">2.2.2</span> Zero nullspace (in notes) </h4>
<div class="outline-text-4" id="text-2_2_2">

<ul>
<li>
if 0 is only element in \(\mathcal{N}(A)\) 
<ul>
<li>
\(A\) is one-to-one
<ul>
<li>
linear transformation doesn't lose information
</li>
</ul>
</li>
<li>
columns of \(A\) are independent, and basis for their span
</li>
<li>
\(A\) has a left inverse \(\Rightarrow\) you can use this to undo the transformation and find the input \(x\), given the output \(y\)
</li>
<li>
\(|A^T A|\ne0\) 
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-2_2_3" class="outline-4">
<h4 id="sec-2_2_3"><span class="section-number-4">2.2.3</span> Interpretations of nullspace </h4>
<div class="outline-text-4" id="text-2_2_3">

<p>supposing \(z \in \mathcal{N}(A)\) 
</p><ul>
<li>
Measurements
<ul>
<li>
\(z\) is undetectable from sensors
</li>
<li>
\(x\) and \(x+z\) are indistinguishable from sensors: \(Ax = A(x+z)\)
</li>
<li>
the nullspace characterizes ambiguity in \(x\) from measurement \(y=Ax\)
<ul>
<li>
large nullspace is bad
</li>
</ul>
</li>
</ul>
</li>
<li>
\(y=Ax\) is output from input \(x\)
<ul>
<li>
\(z\) is input with no result
</li>
<li>
\(x\) and \(x+z\) have same result
</li>
<li>
the nullspace characterizes freedom of input choice for given result
<ul>
<li>
large nullspace is good: more room for optimization because of more input possibilities
</li>
</ul>
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-2_2_4" class="outline-4">
<h4 id="sec-2_2_4"><span class="section-number-4">2.2.4</span> Range </h4>
<div class="outline-text-4" id="text-2_2_4">

<p>Range of \(A \in \mathbb{R}^{m\times n}\) defined as \(\mathcal{R}(A)=\{Ax | x \in \mathbb{R}^n\} \subseteq \mathbb{R}^m\) 
</p><ul>
<li>
The set of vectors that can be `hit' by linear mapping \(y=Ax\)
</li>
<li>
span of columns of \(A\)
</li>
<li>
set of vectors \(y\) for which \(Ax=y\) has a solution
</li>
<li>
possible sensor measurement
<ul>
<li>
in design, you'll want to throw an exception if a measurement is outside the range; the sensor is bad
</li>
<li>
test for a bad 13th sensor: remove 13th row in \(A\); if the reduced \(y\) is in the range of the reduced matrix, the 13th sensor might not have been bad
</li>
</ul>
</li>
</ul>


<ul>
<li id="sec-2_2_4_1">Onto matrices <br/>
\(A\) is `onto' if \(\mathcal{R}(A)=\mathbb{R}^m\)
<ul>
<li>
you can solve \(Ax=y\) for any \(y\)
</li>
<li>
columns of \(A\) span \(\mathbb{R}^m\)
</li>
<li>
\(A\) has a right inverse \(B\) s.t. \(AB=I\)
<ul>
<li>
can do \(ABy=A(By)=y\): you want an \(x\) that gives you \(y\)? Here it is.
</li>
<li>
Design procedure
</li>
</ul>
</li>
<li>
rows of \(A\) are independent
<ul>
<li>
a.k.a., \(\mathcal{N}(A^T)=\{0\}\)
</li>
</ul>
</li>
<li>
\(|AA^T|\ne 0\) 
</li>
</ul>


</li>
</ul>
<ul>
<li id="sec-2_2_4_2">Interpretations of range <br/>
<ul>
<li>
supposing \(v \in \mathcal{R}(A)\)
<ul>
<li>
\(v\) reachable
</li>
<li>
else, not reachable
</li>
</ul>
</li>
</ul>


</li>
</ul>
<ul>
<li id="sec-2_2_4_3">Inverse <br/>
Note: square matrices are impractical for engineering. They don't let you take advantoge of redundant sensors/controllers, or let you build a robust system to take care of broken sensors
<ul>
<li>
\(A \in \mathbb{R}^{n \times n}\) is invertible or nonsingular if det \(A \ne 0\)
<ul>
<li>
columns of \(A\) are basis for \(\mathbb{R}^n\) 
</li>
<li>
rows of \(A\) are basis for \(\mathbb{R}^n\)
</li>
<li>
\(y=Ax\) has a unique solution \(x\) for every \(y \in \mathbb{R}^n\)
</li>
<li>
\(A\) has left and right inverse \(A^{-1} \in \mathbb{R}^{n\times n}\), s.t. \(AA^{-1}=A^{-1}A=I\)
</li>
<li>
\(\mathcal{N}(A)= \{0\}\)
</li>
<li>
\(\mathcal{R}(A)=\mathbb{R}^n\)
</li>
<li>
det \(A^T A= |AA^T| \ne 0\)
</li>
</ul>
</li>
</ul>


<ul>
<li id="sec-2_2_4_3_1">Dual basis intepretation of inverse <br/>
\(a_i\) are columns of \(A\), and \(\tilde b_i^T\) are rows of \(B=A^{-1}\)
<ul>
<li>
\(y=Ax\), column by column, looks like \(y=x_1 a_1 + ... + x_n a_n\)
<ul>
<li>
multiply both sides of \(y=Ax\) by \(A^{-1}=B\) gives \(x=By\)
</li>
<li>
so \(x_i=\tilde b_i^T y\)
</li>
</ul>
</li>
</ul>




\[
\begin{bmatrix}
  \vdots & \vdots & \vdots & \vdots \\
  a_1    & a_2    & ...    & a_n    \\
  \vdots & \vdots & \vdots & \vdots \\
\end{bmatrix}
\begin{bmatrix}
  x_1      \\
  x_2      \\
  \vdots   \\
  x_n      \\
\end{bmatrix}
=
\begin{bmatrix}
  y_1      \\
  y_2      \\
  \vdots   \\
  y_n      \\
\end{bmatrix}
\]

\[
x=A^{-1} y
\]

\[
\begin{bmatrix}
  x_1      \\
  x_2      \\
  \vdots   \\
  x_n      \\
\end{bmatrix}
=
\begin{bmatrix}
  \cdots & \tilde b^T_1 & \cdots \\
  \cdots & \tilde b^T_2 & \cdots \\
  \cdots & \vdots       & \cdots \\
  \cdots & \tilde b^T_n & \cdots \\
\end{bmatrix}
\begin{bmatrix}
  y_1      \\
  y_2      \\
  \vdots   \\
  y_n      \\
\end{bmatrix}
\]

\[
\begin{bmatrix}
  y_1      \\
  y_2      \\
  \vdots   \\
  y_n      \\
\end{bmatrix}
=
\begin{bmatrix}
x_1 a_1 + ... + x_n a_n
\end{bmatrix}
=
\begin{bmatrix}
(\tilde b^T_1 y) a_1 + ... + (\tilde b^T_n y) a_n
\end{bmatrix}
\]

<p>
Beautiful thing:
\[
y=\sum_{i=1}^n (\tilde b_i ^T y) a_i
\]

</p></li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2_2_5" class="outline-4">
<h4 id="sec-2_2_5"><span class="section-number-4">2.2.5</span> Rank of matrix </h4>
<div class="outline-text-4" id="text-2_2_5">

<p>Rank of \(A \in \mathbb{R}^{m \times n}\) as \({\bf rank}(A)= {\bf dim} \mathcal{R}(A)\)
</p><ul>
<li>
\({\bf rank} (A)= {\bf rank} (A^T)\)
</li>
<li>
\({\bf rank} (A)\) is maximum number of independent columns or rows of \(A\): \({\bf rank} (A) \le {\bf min} (m,n)\)
</li>
<li>
\({\bf rank} (A)+ {\bf dim} \mathcal{N}(A)=n\)
</li>
</ul>


<ul>
<li id="sec-2_2_5_1">Conservation of degrees of freedom (dimension) <br/>
<ul>
<li>
\({\bf rank} (A)\) is dimension of set `hit' by mapping \(y=Ax\)
</li>
<li>
\({\bf dim} \mathcal{N}(A)\) is dimension of set of \(x\) `crushed' to zero by \(y=Ax\)
</li>
</ul>


<ul>
<li id="sec-2_2_5_1_1">Example <br/>
<ul>
<li>
\(A \in \mathbb{R}^{20 \times 10} {\bf rank} (A)=8\)
<ul>
<li>
you can do 8 dimensions worth of stuff
</li>
<li>
10 knobs, 2 redundant knobs, which is \({\bf dim} \mathcal{N}(A)=2\)
</li>
</ul>
</li>
</ul>


</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-2_2_5_2">Coding interpretation of rank <br/>
<ul>
<li>
rank of product: \({\bf rank} (BC) \le {\bf min} \{ {\bf rank} (B), {\bf rank} (C)\}\)
</li>
<li>
supposedly really cool stuff based on this
</li>
<li>
low rank matrices let you do fast computations
</li>
</ul>


</li>
</ul>
</div>

</div>

<div id="outline-container-2_2_6" class="outline-4">
<h4 id="sec-2_2_6"><span class="section-number-4">2.2.6</span> Various wrap-up items </h4>
<div class="outline-text-4" id="text-2_2_6">

<ul>
<li id="sec-2_2_6_1">RMS <br/>
\[
{\bf rms} (x) = \left( \frac{1}{n} \sum^n _{i=1} \right) ^{1/2} = \frac{\| x \|}{\sqrt{n}} 
\]
</li>
</ul>
<ul>
<li id="sec-2_2_6_2">Inner product <br/>
\(\langle x,y \rangle := x_1 y_1 + x_2 y_2 + \cdots + x_n y_n = x ^{T} y\) 
<ul>
<li>
intepretation of inner product signs:
</li>
<li>
\(x ^{T} y &gt; 0\): acute; roughly point in same direction
</li>
<li>
\(x ^{T} y &gt; 0\): obtuse; roughly point in opposite direction
</li>
</ul>


</li>
</ul>
<ul>
<li id="sec-2_2_6_3">Orthonormal set of vectors <br/>
<ul>
<li>
set of \(k\) vectors \(u_1, u_2, ..., u_k \in \mathbb{R}^{n}\) orthonormal; \(U= [u_1 \cdots u_k]\)
</li>
<li>
\(U^T U= I_k \leftrightarrow\) set of column vectors of \(U\) are orthonormal
</li>
<li>
\({\bf warning}\): \(U U ^{T} \ne I_k\) if \(k&lt;n\) 
<ul>
<li>
say \(U\) is \(10\times 3\), \(U^T\) is \(3 \times 10\), rank of \(U\) is 3 \(\Rightarrow\) rank of \(UU^T\) is at most 3
</li>
<li>
but \(UU^T\) will be a \(10\times 10\) matrix, so it can't be the identity matrix
</li>
</ul>
</li>
</ul>


</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Lecture 5 </h2>
<div class="outline-text-2" id="text-3">

<p>A good source for more on orthogonality at <a href="http://www.math.umn.edu/~olver/aims_/qr.pdf">University of Minnesota</a>
</p>

</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Geometric properties of orthonormal vectors </h3>
<div class="outline-text-3" id="text-3_1">

<ul>
<li>
columns of \(U\) are ON \(\Rightarrow\) mapping under \(U\) preserves distances
<ul>
<li>
\(w=Uz \Rightarrow \|w \| = \| z \|\)
</li>
</ul>
</li>
<li>
Also preserves inner product
</li>
<li>
Also preserves angles
</li>
<li>
Something like a rigid transformation
</li>
</ul>


</div>

</div>
