lin-dyn-sys-stanford.html

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Orthonormal basis for \(\mathbb{R}^{n}\) </h3>
<div class="outline-text-3" id="text-3_2">

<ul>
<li>
if there are \(n\) orthonormal vectors (remember, with dimension \(n\)), it forms an orthonormal basis for \(\mathbb{R}^{n}\)
</li>
<li>
\(U^{-1}=U^T\)
<ul>
<li>
\fbox{\(U^T U=I \Leftrightarrow U\)'s column vectors form an orthonormal basis for $\mathbb{R}<sup>n</sup>$}
</li>
<li>
\(\displaystyle \sum _{i=1} ^{n} u_i u_i^T = I \in \mathbb{R}^{n \times n}\) (known as a dyad, or outer product; inner products reverses the two and gives a scalar, outer gives a matrix)
</li>
<li>
outer products take 2 vectors, possibly of different sizes, and multiplies every combination of elements one with another
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><span class="section-number-3">3.3</span> Expansion in orthonormal basis </h3>
<div class="outline-text-3" id="text-3_3">

<ul>
<li>
\(U\) orthogonal \(\Rightarrow x=UU^T\)
</li>
<li>
\(\displaystyle x= \sum ^{n} _{i=1} \left( u ^{T} _{i} x\right) u _{i}\)
<ul>
<li>
because \(U^TU=I\), the thing in sum is really \(u_i u_i^T x\)
</li>
<li>
\(u_i^T x\) is really a scalar, so this can be moved to the front of \(u_i\), giving our result
</li>
<li>
This says \(x\) is a linear combination of \(u_i\)'s
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-3_4" class="outline-3">
<h3 id="sec-3_4"><span class="section-number-3">3.4</span> Gram-Schmidt procedure </h3>
<div class="outline-text-3" id="text-3_4">

<ul>
<li>
\(a_1, ..., a_k \in \mathbb{R}^{n}\) are LI; G-S finds ON vectors \(q_1,..., q_k\) s.t. $$ {\bf span} (a_1,...,a_r)= {\bf span} (q_1,...,q_r)$$ for \(r \le k\)
</li>
<li>
so \(q_1, ..., q_r\) is an ON basis for span(\(a_1, ...,a_r\))
</li>
<li>
Basic method: orthogonalize each vector wrt the previous ones, then normalize result
<ol>
<li>
\(\tilde q_1 = a_1\)
</li>
<li>
normalize: \(q_1 = \tilde q_1/ \|\tilde q_1 \|\)
</li>
<li>
remove \(q_1\) component from \(a_2\): \(\tilde q_2 = a_2 - (q_1^T a_2) q_1\)
</li>
<li>
normalize \(q_2\)
</li>
<li>
remove \(q_1, q_2\) components: \(\tilde q_3= a_3 - (q_1^T a_3) q_1 - (q_2^T a_3)q_2\) 
</li>
<li>
normalize \(q_3\) 
</li>
</ol>
</li>
<li>
\(a_i= (q_1^T a_i) q_1 + (q_2^T a_i)q_2 + \cdots + (q_{i-1}^T a_i)q_{i-1} + \| \tilde q_i \| q_i\)
<ul>
<li>
\(= r_{1i} q_1 + r_{2i} q_2 + \cdots + r_{ii} q_i\) (\(r_{ii} \ge 0\) is the length of \(\tilde q_i\))
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-3_5" class="outline-3">
<h3 id="sec-3_5"><span class="section-number-3">3.5</span> \(QR\) decomposition </h3>
<div class="outline-text-3" id="text-3_5">

<p>This can be written as \(A=QR\), where \(A \in \mathbb{R}^{n \times k}, Q \in \mathbb{R}^{n \times k} , R \in \mathbb{R}^{k\times k}\)
</p>


\[
\begin{bmatrix}
  a_1 & a_2 & \cdots & a_k \\
\end{bmatrix}
=
\begin{bmatrix}
  q_1 & q_2 & \cdots & q_k \\
\end{bmatrix}
\begin{bmatrix}
  r_{11} & r_{12} & \cdots & r_{1k} \\
         0 & r_{22} & \cdots & r_{2k} \\
    \vdots & \vdots   & \ddots & \vdots   \\
         0 & 0        & \cdots & r_{kk} \\
\end{bmatrix}
\]
<ul>
<li>
\(R\) triangular because computation of \(a_i\) only involves up to \(q_i\)
<ul>
<li>
a sort of causality, since you can calculate \(q_7\) without seeing \(q_8\)
</li>
</ul>
</li>
<li>
Columns of \(Q\) are ON basis for \(\mathcal{R}(A)\)
</li>
</ul>


</div>

</div>

<div id="outline-container-3_6" class="outline-3">
<h3 id="sec-3_6"><span class="section-number-3">3.6</span> General Gram Schmidt procedure (`rank revealing QR algorithm') </h3>
<div class="outline-text-3" id="text-3_6">

<ul>
<li>
Basically the same, but if one of the \(\tilde q_i\)'s is zero (meaning \(a_i\) is dependent on previous \(a\) vectors), then just go to the next column
</li>
<li>
referring to notes, upper staircase notation shows which vectors are dependent on previous ones (columns without the x's)
<ul>
<li>
entries with x are `corner' entries
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-3_7" class="outline-3">
<h3 id="sec-3_7"><span class="section-number-3">3.7</span> Applications </h3>
<div class="outline-text-3" id="text-3_7">

<ul>
<li>
check if \(b \in {\bf span} (a_1, a2, ..., a_k)\)
</li>
<li>
Factorize matrix \(A\)
</li>
</ul>


</div>

</div>

<div id="outline-container-3_8" class="outline-3">
<h3 id="sec-3_8"><span class="section-number-3">3.8</span> Least Squares Approximation </h3>
<div class="outline-text-3" id="text-3_8">

<ul>
<li>
Overdetermined linear equation (tall, skinny, more equations than unknowns, dimensionally redundant system of equations)
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Lecture 6 </h2>
<div class="outline-text-2" id="text-4">

<p>On skinny, full rank matrices
</p>
</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Overdetermined equations </h3>
<div class="outline-text-3" id="text-4_1">

<ul>
<li>
Skinny, more equations than unknowns
</li>
<li>
Given \(y=Ax, A\in \mathbb{R}^{m\times n}\), a randomly-chosen \(y\) in \(\mathbb{R}^{m}\) has 0 probability of being in the range of \(A\)
</li>
<li>
To \(approximately\) solve for \(y\), minimize norm of error (residual) \(r=Ax-y\)
</li>
<li>
find \(x=x _{ls}\) (least squares approx.) that minimizes \(\|r\|\)
</li>
</ul>


</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> Least Squares `Solution' </h3>
<div class="outline-text-3" id="text-4_2">

<ul>
<li>
square \(\|r\|\), get expansion, set gradient wrt \(x\) equal to zero
</li>
<li>
\fbox{\(x _{ls} = (A ^{T} A) ^{-1} A ^{T} y\) } \(=B_{ls} y\) (linear operation)
</li>
<li>
\(A ^{T} A\) should be invertible, square, full rank
</li>
<li>
\((A ^{T} A)^{-1} A ^{T}\) is a generalized inverse (is only inverse for square matrices, though)
<ul>
<li>
Also known as the \(A^\dagger\), `pseudo-inverse'
</li>
<li>
Which is a left inverse of \(A\)
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-4_3" class="outline-3">
<h3 id="sec-4_3"><span class="section-number-3">4.3</span> Projection on \(\mathcal{R}(A)\) </h3>
<div class="outline-text-3" id="text-4_3">

<p>\(Ax _{ls}\) is the point closest to \(y\) (i.e., projection of \(y\) onto \(\mathcal{R}(A)\))
</p><ul>
<li>
\(A x _{ls} = {\bf proj} _{ \mathcal{R}(A)} (y)= \left(A(A ^{T} A) ^{-1} A ^{T} \right)y\) 
</li>
</ul>


</div>

</div>

<div id="outline-container-4_4" class="outline-3">
<h3 id="sec-4_4"><span class="section-number-3">4.4</span> Orthogonality principle </h3>
<div class="outline-text-3" id="text-4_4">

<p>The optimal residual is orthogonal to \(C(A)\)
</p><ul>
<li>
\(r = A x _{ls} -y = (A(A ^{T} A) ^{-1} A ^{T} -I)y\) orthogonal to \(C(A)\)
</li>
<li>
\(\langle r, Az \rangle = y ^{T} (A(A ^{T} A) ^{-1} A ^{T} -I) ^{T} Az = 0\) for all \(z \in \mathbb{R}^{n}\) 
</li>
</ul>


</div>

</div>

<div id="outline-container-4_5" class="outline-3">
<h3 id="sec-4_5"><span class="section-number-3">4.5</span> Least-squares via \(QR\) factorization </h3>
<div class="outline-text-3" id="text-4_5">

<p>\(A\) is still skinny, full rank
</p><ul>
<li>
Factor as \(A=QR\); \(Q^TQ=I_n, R \in \mathbb{R}^{n\times n}\) upper triangular, invertible
</li>
<li>
pseudo-inverse: \((A ^{T} A) ^{-1} A ^{T} = R ^{-1} Q ^{T} \Rightarrow\) \fbox{$R <sup>-1</sup> Q <sup>T</sup> y = x <sub>ls</sub>$}
</li>
<li>
Pretty straight-forward
</li>
<li>
Matlab for least squares approximation
<pre class="example">
xl = inv(A' * A)*A'y; # So common that has shorthand in MATLAB
xl = A\y;                 # Works for non-skinny matrices, may do unexpected things
</pre>

</li>
</ul>


</div>

</div>

<div id="outline-container-4_6" class="outline-3">
<h3 id="sec-4_6"><span class="section-number-3">4.6</span> Full \(QR\) factorization </h3>
<div class="outline-text-3" id="text-4_6">

<ul>
<li>
\(A= \begin{bmatrix}Q_1 &amp; Q_2 \end{bmatrix} \begin{bmatrix} R_1 \\ 0 \end{bmatrix}\)
<ul>
<li>
New \(Q\) is square, orthogonal matrix; \(R_1\) is square, upper triangular, invertible
</li>
</ul>
</li>
<li>
Remember, multiplying by orthogonal matrix doesn't changet the norm:
<ul>
<li>
\(\| A x-y \| ^{2} = \| R_1 x - Q ^{T} _{1} y \|^2 + \| Q ^{T} _{2} y \| ^{2}\)
</li>
<li>
Find least squares approximation with \(x _{ls} = R ^{-1} _{1} Q ^{T} _{1} y\) (zeroes first term)
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-4_7" class="outline-3">
<h3 id="sec-4_7"><span class="section-number-3">4.7</span> Applications for least squares approximations </h3>
<div class="outline-text-3" id="text-4_7">

<ul>
<li>
if there is some noise \(v\) in \(y = Ax+v\)
<ul>
<li>
you can't reconstruct \(x\), but you can get close with the approximation
</li>
</ul>
</li>
<li>
Estimation: choose some \(\hat x\) that minimizes \(\| A \hat x - y\|\), which is the deviation between the think we observed, and what we would have observed in the absence of noise
</li>
</ul>


</div>

</div>
