lin-dyn-sys-stanford.html

<div id="outline-container-4_8" class="outline-3">
<h3 id="sec-4_8"><span class="section-number-3">4.8</span> BLUE: Best linear unbiased estimator </h3>
<div class="outline-text-3" id="text-4_8">

<ul>
<li>
\(A\) still full rank and skinny; have a `linear estimator' \(\hat x= By\) (\(B\) is fat)
<ul>
<li>
\(\hat x = B(Ax+v)\)
</li>
</ul>
</li>
<li>
Called unbiased if there is no estimation error when there's no noise; the estimator works perfectly in the absence of noise
<ul>
<li>
if \(v=0\) and \(BA=I\); \(B\) is left inverse/perfect reconstructor
</li>
</ul>
</li>
<li>
Estimation error uf unbiased linear estimator is \(x- \hat x= sBv\), so we want \(B\) to be small and \(BA=I\); small means error isn't sensitive to the noise
</li>
<li>
The pseudo-inverse is the smallest left inverse of \(A\):
<ul>
<li>
\(A ^{\dagger} = (A ^{T} A) ^{-1} A ^{T}\)
</li>
<li>
\(\displaystyle \sum _{i,j} B ^{2} _{ij} \ge \sum _{i,j} A _{ij} ^{\dagger 2}\)
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-4_9" class="outline-3">
<h3 id="sec-4_9"><span class="section-number-3">4.9</span> Range-finding example </h3>
<div class="outline-text-3" id="text-4_9">

<ul>
<li>
Find ranges to 4 beacons from an unknown position \(x\)
</li>
<li>
\(y = - \begin{bmatrix}
           k _{1} ^{T} \\ k _{2 } ^{T} \\ k _{3} ^{T} \\ k _{4} ^{T} 
         \end{bmatrix} x + v\)
</li>
<li>
actual position \(x=(5.59, 10.58)\); measurement \(y=(-11.95, -2.84, -9.81, 2.81)\)
<ul>
<li>
these numbers aren't consistent in \(Ax=y\), since there's also the error; there is no such \(x\) value that can give this \(y\) value
</li>
</ul>
</li>
<li>
There are 2 redundant sensors (2 more \(y\) values than \(x\) values); one method for estimating \(\hat x\) is `just enough' method: you only need 2 \(y\) values; take inverse of top half of \(A\) and pad the rest of the matrix with 0's
</li>
<li>
use \(\hat x = B _{just enough} y = \begin{bmatrix}\begin{bmatrix} k_1 ^{T} \\ k_2 ^{T} \end{bmatrix} ^{-1} \begin{matrix} 0 &amp; 0 \\ 0 &amp; 0 \end{matrix}\end{bmatrix} = \begin{bmatrix}
                                           0 & -1.0 & 0 & 0 \\ -1.12 &   .5 & 0 & 0 \\   
                                     \end{bmatrix} y = \begin{bmatrix} 2.84 \\ 11.9 \end{bmatrix}\)
</li>
<li>
Least Squares method: \(\hat x A ^{\dagger} y =\) this has a much smaller norm of error
</li>
<li>
Just enough estimator doesn't seem to have good performance&hellip;unless last two measurements were really off, since JEM only takes 2 measurements into account
</li>
</ul>


</div>

</div>

<div id="outline-container-4_10" class="outline-3">
<h3 id="sec-4_10"><span class="section-number-3">4.10</span> Quantizer example </h3>
<div class="outline-text-3" id="text-4_10">

<p>Super-impressive least squares estimate; more precise than A-D converter
</p></div>

</div>

<div id="outline-container-4_11" class="outline-3">
<h3 id="sec-4_11"><span class="section-number-3">4.11</span> Least Squares data-fitting </h3>
<div class="outline-text-3" id="text-4_11">

<ul>
<li>
use functions \(f_1, f_2, ..., f_n:S \rightarrow \mathbb{R}\) are called regressors or basis functions
</li>
<li>
applications
<ul>
<li>
interpolation- , extrapolation, smoothing of data
</li>
</ul>
</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Applications</th><th scope="col" class="left"></th></tr>
</thead>
<tbody>
<tr><td class="left">interpolation</td><td class="left">don't have sensors in specific location, but want the temperature</td></tr>
<tr><td class="left">extrapolation</td><td class="left">get good basis functions for better interpolation</td></tr>
<tr><td class="left">data smoothing</td><td class="left">de-noise measurements</td></tr>
<tr><td class="left">simple, approximate data model</td><td class="left">Get a million samples, use the data-fitting to get a simple approximate function</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-4_12" class="outline-3">
<h3 id="sec-4_12"><span class="section-number-3">4.12</span> Least-squares polynomial fitting </h3>
<div class="outline-text-3" id="text-4_12">

<ul>
<li>
Vandermonde matrix?
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Lecture 7 </h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5_1" class="outline-3">
<h3 id="sec-5_1"><span class="section-number-3">5.1</span> Least-squares polynomial fitting, cont'd </h3>
<div class="outline-text-3" id="text-5_1">

<ul>
<li>
have data samples \((t_i, y_i), i=1,...,m\)
</li>
<li>
fit coefficients \(a_i\) of polynomial \(p(t)= a_0 + a_1 t + \cdots + a _{n-1} t ^{t-1}\) so that when evaluated at \(t_i\) it will give you the associated \(y\) value
</li>
<li>
basis functions are \(f_j(t)= t ^{j-1}, j=1,...,n\)
</li>
<li>
use Vandermonde matrix \(A\) (`polynomial evaluator matrix'):
</li>
</ul>




\[
A=
\begin{bmatrix}
  1 & t_1    & t_1^2 & ... & t_1^{n-1} \\
  1 & t_2    & t_2^2 & ... & t_2^{n-1} \\
    & \vdots &       &     & \vdots    \\
  1 & t_m    & t_m^2 & ... & t_m^{n-1} \\
\end{bmatrix}
\]
<ul>
<li>
side note: use this when you want to fit throughout an interval, use a Taylor series fit if you want it close to a point
</li>
</ul>


</div>

</div>

<div id="outline-container-5_2" class="outline-3">
<h3 id="sec-5_2"><span class="section-number-3">5.2</span> Growing sets of regressors </h3>
<div class="outline-text-3" id="text-5_2">

<ul>
<li>
Given ordered set of vectors; find best fit with first vector, then best fit with first and second, then best fit with first three&hellip;
</li>
<li>
These vectors called <i>regressors</i>, or columns
</li>
<li>
Say you have some <i>master list</i> \(A\) with \(n\) columns, and \(A ^{(p)}\) will be the matrix with the first \(p\) columns of it
<ul>
<li>
we want to minimize different sets of \(\| A ^{(p)} x-y \|\)
</li>
<li>
i.e., project \(y\) onto a growing span \(\{a_1, a_2, ..., a_p\}\)
</li>
</ul>
</li>
<li>
Solution for each \(p \le n\) given by \(x _{ls} ^{(p)} = (A ^{T} _{p} A _{p} )^{-1} A _{p} ^{T} y = R ^{-1} _{p} Q ^{T} _{p} y\)
<ul>
<li>
In MATLAB, <code>A(:,1:p)\y</code>, though technically it's faster to do a sort of <code>for</code> loop
</li>
</ul>
</li>
<li>
Residual, \(\| \sum ^{p} _{i=1} x_i a_i -y \|\) reduces as \(p\) (number of columns) increases
<ul>
<li>
though it may be same as residual with previous value of \(p\) if the optimal \(x_1=0\), when \(y \perp a_1\)
</li>
<li>
if the residual drops 15% from that of previous value of \(p\), you say that \(a_1\) explains 15% of \(y\)
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-5_3" class="outline-3">
<h3 id="sec-5_3"><span class="section-number-3">5.3</span> Least-squares system identification (important topic) </h3>
<div class="outline-text-3" id="text-5_3">

<ul>
<li>
measure input, output \(u(t), y(t)\) for \(t=0,...,N\) of unknown system, and try to get a model of system
</li>
<li>
example: moving average (MA) model with \(n\) delays (try to approximate what are the weights \(h_i\) for each delay)
<ul>
<li>
see equation/matrix in notes, though there are different ways to write it
</li>
<li>
get best answer with LSA
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-5_4" class="outline-3">
<h3 id="sec-5_4"><span class="section-number-3">5.4</span> Model order selection </h3>
<div class="outline-text-3" id="text-5_4">

<ul>
<li>
how large should \(n\) be?
</li>
<li>
the larger, the smaller prediction error on <i>data used to form model</i>
</li>
<li>
but at a certain point, predictive ability of model on other I/O data from same system worsens
</li>
<li>
probably best to choose the `knee' on the graph on notes slide for prediction of new data
</li>
</ul>



</div>

<div id="outline-container-5_4_1" class="outline-4">
<h4 id="sec-5_4_1"><span class="section-number-4">5.4.1</span> Cross-validation </h4>
<div class="outline-text-4" id="text-5_4_1">

<ul>
<li>
check with new data, only if you're getting small residuals on data you've already seen
</li>
<li>
when \(n\) gets too large (greater than \(n=10\) on graph), the error with `validation data' actually gets larger
</li>
<li>
this example is ideal, since \(n=10\) is the obvious order for the model
</li>
<li>
<b>Application note</b>: in medical, many industries, there's a firm wall between validation data and model-developing data, so someone <i>else</i> tests your model
</li>
<li>
in this example, it is known as <i>overfit</i> when the validation data error gets larger for \(n\) too large
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-5_5" class="outline-3">
<h3 id="sec-5_5"><span class="section-number-3">5.5</span> Growing sets of measurements </h3>
<div class="outline-text-3" id="text-5_5">

<ul>
<li>
similar to GSo Regressors, except you add new rows, not columns
</li>
<li>
this would happen if we're estimating a parameter \(x\) (which is constant)
</li>
<li>
Solution: \(\displaystyle x_{ls} = \left( \sum ^{m} _{i=1} a_i a_i ^{T} \right) ^{-1} \sum ^{m} _{i=1} y_i a_i\)
</li>
<li>
new way to think of least squares equation
</li>
</ul>


</div>

</div>
