lin-dyn-sys-stanford.html

<div id="outline-container-5_6" class="outline-3">
<h3 id="sec-5_6"><span class="section-number-3">5.6</span> Recursive ways to do least squares </h3>
<div class="outline-text-3" id="text-5_6">

<ul>
<li>
don't have to re-add for each new measurement
<ul>
<li>
i.e., memory is bounded
</li>
<li>
use equation from notes; solution is \(x _{ls} (m) = P(m) ^{-1} q(m)\)
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-5_7" class="outline-3">
<h3 id="sec-5_7"><span class="section-number-3">5.7</span> Fast update algorithm for recursive LS </h3>
<div class="outline-text-3" id="text-5_7">

<ul>
<li>
Was a big deal back in the day; somewhat still
</li>
</ul>


</div>

</div>

<div id="outline-container-5_8" class="outline-3">
<h3 id="sec-5_8"><span class="section-number-3">5.8</span> Multi-objective least squares </h3>
<div class="outline-text-3" id="text-5_8">

<ul>
<li>
Sometimes you have 2+ objectives to minimize
<ul>
<li>
say \(J_1 = \| Ax-y\| ^{2}\) (what we've done so far)
</li>
<li>
and \(J_2 = \| Fx-g\| ^{2}\)
</li>
<li>
these are usually competing (minimize one at cost of other)
</li>
</ul>
</li>
<li>
Variable in question is \(x \in \mathbb{R}^{n}\)
</li>
<li>
Plot in notes shows plot of \((J_1(x_i), J_2(x_i))\)
</li>
<li>
Some points are unambiguously worse than others, but there is some ambiguity when \(J_1(x_1) &lt; J_1(x_2)\), while \(J_2(x_1) &gt; J_2(x_2)\)
</li>
<li>
Fix this ambiguity with `weighted-sum objective'
</li>
<li>
\(J_1 + \mu J_2 = \| Ax-y\| ^{2} + \mu \| Fx-g\| ^{2}\)
<ul>
<li>
Say, there's a trade-off between smoothness (no noise) and better fit; \(\mu\) can have different dimensions if \(J_2\) does
</li>
</ul>
</li>
<li>
Use slope of \(\mu\) in graph (`indifference curve', in economics) [slide 7-6]
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Lecture 8 </h2>
<div class="outline-text-2" id="text-6">

<p>Multi-objective least-squares
</p>
</div>

<div id="outline-container-6_1" class="outline-3">
<h3 id="sec-6_1"><span class="section-number-3">6.1</span> Plot of achievable objective pairs </h3>
<div class="outline-text-3" id="text-6_1">

<ul>
<li>
if it approximates an L shape (has a `knee'), the knee is usually the obvious optimal location, so least-squares isn't as helpful
<ul>
<li>
optimal point isn't very sensitive to &mu;
</li>
</ul>
</li>
<li>
Other extreme: trade-off curve looks linear (negative slope), where it's zero-sum
<ul>
<li>
optimal point very sensitive to &mu;
</li>
<li>
slope commonly called <i>exchange rate curve</i>
</li>
</ul>
</li>
<li>
In this class, they must be convex curves (cup up/outward)
</li>
<li>
To find Pareto optimal points, minimize \(J_1 + \mu J_2 = \alpha\)
<ul>
<li>
on plot, can have level curves with slope &mu;
</li>
<li>
Find point on Pareto Optimal Curve that has slope &mu;
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-6_2" class="outline-3">
<h3 id="sec-6_2"><span class="section-number-3">6.2</span> Minimizing weighted-sum objective </h3>
<div class="outline-text-3" id="text-6_2">

<ul>
<li>
note: norm-squared of a stacked vector is norm-square of the top+norm-square of bottom
</li>
</ul>




$$J_1+\mu J_2 = \| Ax - y \| ^{2} + \mu \| Fx - g \| ^{2} = \left\|
\begin{bmatrix}
  A           \\
  \sqrt \mu F \\
\end{bmatrix}
x-
\begin{bmatrix}
  y \\
  \sqrt \mu g \\
\end{bmatrix}
\right\| ^{2} 
$$
\[
= \left\| \tilde Ax- \tilde y \right\|
\]
<p>
where
\[
\tilde A =
\begin{bmatrix}
  A           \\
  \sqrt \mu F \\
\end{bmatrix}
, \tilde y =
\begin{bmatrix}
  y \\
  \sqrt \mu g \\
\end{bmatrix}
\]
If \(\tilde A\) is full rank,
\begin{eqnarray}
x &=& \left( \tilde A ^{T} \tilde A \right)^{-1} \tilde A ^{T} \tilde y \\
  &=& ( A ^{T} A + \mu F ^{T} F) ^{-1} (A ^{T} y + \mu F ^{T} g)
\end{eqnarray}
Note: to plot the tradeoff curve, calculate the minimizer \(x_\mu\), and plot the resulting pairs \((J_1, J_2)\) 
In MATLAB, <code>[A; sqrt(mu) * F]\[y;sqrt(mu) * g]</code>
</p></div>

</div>

<div id="outline-container-6_3" class="outline-3">
<h3 id="sec-6_3"><span class="section-number-3">6.3</span> Example: frictionless table </h3>
<div class="outline-text-3" id="text-6_3">

<ul>
<li>
\(y\) is final position at \(t=10\); \(y=a ^{T} x\), \(a\in \mathbb{R}^{10}\) 
</li>
<li>
\(J_1 = (y-1) ^{2}\), (final position difference from \(y=1\) squared)
</li>
<li>
\(J_2 = \|x\| ^{2}\) sum of force squares
</li>
<li>
Q: Why do we often care about sum of squares? A: <b>It's easy to analyze</b> (not necessarily because it corresponds to energy)
<ul>
<li>
max \(| x_i |\) corresponds to maximum thrust
</li>
<li>
\(\sum |x_i|\) corresponds to fuel use
</li>
</ul>
</li>
<li>
Optimal tradeoff curve is quadratic
</li>
</ul>


</div>

</div>

<div id="outline-container-6_4" class="outline-3">
<h3 id="sec-6_4"><span class="section-number-3">6.4</span> Regularized least-squares </h3>
<div class="outline-text-3" id="text-6_4">

<ul>
<li>
famous example of multi-objective least squares
<ul>
<li>
second \(J\) term is simply \(J_2 = \|x\|\), though first is the same: \(J_1 = \|Ax-y\| ^{2}\) 
</li>
</ul>
</li>
<li>
Tychonov regularization works for <i>any</i> \(A\)
<ul>
<li>
<i>regularized</i> least-squares solution: \fbox{$x<sub>&mu;</sub> = (A <sup>T</sup> A + &mu; I) <sup>-1</sup> A <sup>T</sup> y$}, for \(F=I, g=0\) 
</li>
</ul>
</li>
</ul>


<p>
Show \((A ^{T} A + \mu I)\) is invertible, no matter what size/values of \(A\) (assuming \(\mu &gt; 0\) ): 
If this is <i>not</i> invertible (singular), it means some nonzero vector \(z\) gets mapped to zero (\(z \in \mathcal{N}(A)\))
\begin{eqnarray}
(A ^{T} A + \mu I) z= 0, z \ne 0 \\
z ^{T} (A ^{T} A + \mu I) z = 0 \text{ since } z^T \vec{0} =0 \\
z ^{T} A ^{T} A z + \mu z ^{T} z = 0 \\
\| A z \| ^{2} + \mu \| z \| ^{2} = 0 \\
z = \vec{0} 
\end{eqnarray}
So, \(z\) can only be zero, meaning \(\mathcal{N}(A) = \{0\} \Rightarrow (A ^{T} A -\mu I)\) is invertible. This is also why &mu; must be positive.
Or, you know it's invertible, since it is full rank (and skinny) when you stack \(\mu I\) below it (see definition of \(\tilde A\)).
</p><ul>
<li>
Application of Regularized least-squares
<ul>
<li>
estimation/inversion
</li>
<li>
\(Ax-y\) is sensor residual
</li>
<li>
prior information that \(x\) is really small
</li>
<li>
or, model only accurate for small \(x\)
</li>
<li>
Tychonov solution trades off sensor fit and size of \(x\)
</li>
</ul>
</li>
<li>
Image processing example
<ul>
<li>
Laplacian regularization
<ul>
<li>
image reconstruction problem
</li>
</ul>
</li>
<li>
\(x\) is vectorized version of image
</li>
<li>
\(\|A x - y\| ^{2}\) is difference from real image
</li>
<li>
Want new objective to minimize roughness
<ul>
<li>
vector \(Dx\) (from new matrix \(D\)) which has difference between neighboring pixels as elements
<ul>
<li>
\(D_v x\) measures vertical difference 
</li>
<li>
\(D_h x\) measures horizontal difference 
</li>
<li>
Nullspace is vector where there is no variation between pixels
</li>
</ul>
</li>
</ul>
</li>
<li>
minimize \(\|A x-y\| ^{2} + \mu \| [D_h x \text{ } D_v x]^{T} \| ^{2}\)
<ul>
<li>
if \(\mu\) is turned way up, it'll be all smoothed out
</li>
<li>
if you care about total size of image, you can add another parameter &lambda;: \(\|A x-y\| ^{2} + \mu \| [D_h x \text{ } D_v x]^{T} \| ^{2} + \lambda \|x\| ^{2}\)
</li>
</ul>
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-6_5" class="outline-3">
<h3 id="sec-6_5"><span class="section-number-3">6.5</span> Nonlinear least squares (NLLS) problem </h3>
<div class="outline-text-3" id="text-6_5">

<ul>
<li>
find \(x\in \mathbb{R}^{n}\) that minimizes \(\displaystyle \| r(x) \| ^{2} = \sum ^{m} _{i=1} r _{i} (x) ^{2}\)
</li>
<li>
\(r(x)\) is vector of residuals; \(r(x)= Ax-y \Rightarrow\) problem reduces to linear least squares problem
</li>
<li>
in general, can't <b>really</b> solve a NLLS problem, but can find good heuristics to get a locally optimal solution
</li>
</ul>


</div>

</div>
