lin-dyn-sys-stanford.org
** Gauss-Newton method for NLLS
- Start guess for $x$
- Loop
  - linearize $r$ near current guess
  - new guess is linear LS solution, using linearized $r$
  - if convergence, stop
- Linearize?
  - Jacobian: $(Dr) _{ij} = \partial r _{i} / \partial x_j$
  - Linearization: $r (x) \approx r(x ^{(k)}) + Dr(x ^{(k)} ) (x-x ^{(k)} )$
  - Set this linearized approximation equal to $r(x) \approx A ^{(k)} x-b ^{(k)}$
    - $A ^{(k)} = Dr(x ^{(k)})$
    - $b ^{(k)} = Dr (x ^{(k)}) x ^{(k)} -r(x ^{(k)})$ 
  - See rest in notes
  - At $k$ th iteration, approximate NLLS problem by linear LS problem:
    - $\| r (x) \| ^{2} \approx \left\| A ^{(k)} x-b ^{(k)} \right\| ^{2}$
      - if you wanna make this really cool add a $\mu \|x-x ^{(k)} \| ^{2}$ term on RHS
      - called a `trust region term';
      - first (original) part says to minimize sum of squares for /model/
      - trust region term says `but don't go far from where you are now'
- Could also linearize without calculus; works really well 
  - See `particle filter'
** G-N example
- Nice graph and residual plot
- As practical matter, good to run simulation several times (with different initial guesses)
- `exuastive simulation'
** Underdetermined linear equations
- $A \in \mathbb{R}^{m \times n}, m<n$ ($A$ is fat)
- more variables than equations
- $x$ is underspecified
- For this sectian *assume $A$ is full rank*
- Set of all solutions has form $\{x | Ax=y\} = \{x_p + z | z \in \mathcal{N}(A) \}$
- solution has dim $\mathcal{N}(A)= n-m$ `degrees of freedom'
  - many DOF: good for design (flexibility), bad for estimation (stuff you don't/can't know with available measurements)
** Least norm solution
- \fbox{$x _{ls} = A ^{T} (AA ^{T}) ^{-1} y$}
  - similar to our familiar skinny $A$ version: $x _{ls} = (A^{T} A) ^{-1} A ^{T} y$
  - mnemonic: $(\cdot) ^{-1}$ thing must be square
    - if $A$ skinny, both $A A ^{T} and $ $A^TA$ could be square (syntactically)
    - semantically, you need the up and down patterns that will form the smallest square, i.e., full rank matrix
* Lecture 9 pt 2
Thank you fucking Suncheon.
** General norm minimization with equality constraints
- Problem: \fbox{minimize $\|A x-b\|$ subject to $Cx=d$, with variable $x$}
- Least squares/least norm are special cases
  - Least norm: set $A=I, b=0$, then you just have norm of $x$ subject to some linear equations
- Same as: minimize $(1/2) \|Ax-b\| ^{2}$ subject to $Cx=d$
- Lagrangian is...long ugly thing...look at notes
  - a bit easier to look at block matrix format
$$
\begin{bmatrix}
  A ^{T} A & C ^{T} \\
  C        & 0      \\
\end{bmatrix}
\begin{bmatrix}
  x       \\
  \lambda \\
\end{bmatrix}
=
\begin{bmatrix}
  A ^{T} b \\
  d        \\
\end{bmatrix}
$$
- recover least squares (maybe) by eliminating $C$ from matrix (not setting to zero, but only having 1 row/column in first matrix)

** Autonomous linear dynamical systems
``What the class is nominally about''
- In continuous time, autonomous LDS has form $\dot x = Ax$
- Solution: $x(t) = e ^{ta} x(0)$
- $x(t) \in \mathbb{R}^{n}$ is called the state
  - $n$ is state dimension
- $A$ basically maps where you are ($x$) to where you're going ($\dot x$)
  - has units of s$^{-1}$, frequency
- Example illustration: vector fields
** Block diagrams
- use integrators to express $\dot x =Ax$ instead of differentiators
  - block called `bank of integrators'
  - historically used because of analog, mechanical computers
- notches to express $n$ signals
** Linear circuit example
* Lecture 10
Examples of autonomous linear dynamical systems, $\dot x = Ax$ 
** Example: Series reaction $A \rightarrow B \rightarrow C$ 
$$
\dot x=
\begin{bmatrix}
  -k_1 & 0    & 0 \\
  k_1  & -k_2 & 0 \\
  0    & k_2  & 0 \\
\end{bmatrix}
x
$$
- For second row, first term on rhs of $\dot x_2 = k_1 x_1 - k_2 x_1$ is /buildup/
- Note: Column sums are 0 implies conservation of mass/materials;
** Discrete time Markov chain
- $x(t+1) = Ax(t)$
- $x(t) = A ^{t} x(0)$
- Given current state, the matrix of /transition probabilities/ $P$ will tell you probabilities of the next state, given the current state
** Numerical integration of continuous system
- for a small time step $h$, find about where you'll be in $h$ seconds b
- $x(t+h) \approx x(t) + h \dot x(t) = (I + hA) x(t)$
- problem: when you do it for a long time, error can build up pretty high
** Higher order linear dynamical systems ($\dot x=Ax$)
$x ^{(k)} = A _{k-1} x ^{(k-1)} + \cdots + A _{1} x ^{(1)} + A _{0} x, x(t) \in \mathbb{R}^{n}$
- define new variable
$$
z =
\begin{bmatrix}
  x          \\
  x ^{(1)}   \\
  \vdots     \\
  x ^{(k-1)} \\
\end{bmatrix}
\in \mathbb{R}^{nk},
\dot z =
\begin{bmatrix}
  x ^{(1)}   \\
  \vdots     \\
  x ^{(k)} \\
\end{bmatrix}
=
\begin{bmatrix}
       0 &   I &   0 & \cdots & 0        \\
       0 &   0 &   I & \cdots & 0        \\
  \vdots &     &     &        & \vdots   \\
       0 &   0 &   0 & \cdots & I        \\
     A_0 & A_1 & A_2 & \cdots & A _{k-1} \\
\end{bmatrix}
z
$$
- `upshift $x$, and zero-pad'
- $z$ is the state, not $x$
- in notes, black diagram with chain of integrators
** Example: Mechanical systems
- Ex: $K _{12}$ is `cross-stiffness', how much stiffness you'd feel at node 1 from node 2
** Linearization near equilibrium point
Equilibrium point corresponds to constant solution ($f(x_e)= 0, x(t)=x_e$)
- if you start at an equilibrium point, you'll stay there
- if you start /near/ equilibrium point
  - veer off (unstable)
  - go towards equilibrium (stable)
  - something in between
- but, you never stay at an unstable equilibrium position, since equation is really $\dot x = f(x) + w(t)$, where $w(t)$ is noise
- Near equilibrium point, $\dot{\delta x}(t) \approx Df(x_e) \delta x(t)$, where $D$ is the Jacobian
  - similar to euler forward equation
- Don't fully trust approximations on approximations (but hope they work)
