lin-dyn-sys-stanford.html

<div id="outline-container-6_6" class="outline-3">
<h3 id="sec-6_6"><span class="section-number-3">6.6</span> Gauss-Newton method for NLLS </h3>
<div class="outline-text-3" id="text-6_6">

<ul>
<li>
Start guess for \(x\)
</li>
<li>
Loop
<ul>
<li>
linearize \(r\) near current guess
</li>
<li>
new guess is linear LS solution, using linearized \(r\)
</li>
<li>
if convergence, stop
</li>
</ul>
</li>
<li>
Linearize?
<ul>
<li>
Jacobian: \((Dr) _{ij} = \partial r _{i} / \partial x_j\)
</li>
<li>
Linearization: \(r (x) \approx r(x ^{(k)}) + Dr(x ^{(k)} ) (x-x ^{(k)} )\)
</li>
<li>
Set this linearized approximation equal to \(r(x) \approx A ^{(k)} x-b ^{(k)}\)
<ul>
<li>
\(A ^{(k)} = Dr(x ^{(k)})\)
</li>
<li>
\(b ^{(k)} = Dr (x ^{(k)}) x ^{(k)} -r(x ^{(k)})\) 
</li>
</ul>
</li>
<li>
See rest in notes
</li>
<li>
At \(k\) th iteration, approximate NLLS problem by linear LS problem:
<ul>
<li>
\(\| r (x) \| ^{2} \approx \left\| A ^{(k)} x-b ^{(k)} \right\| ^{2}\)
<ul>
<li>
if you wanna make this really cool add a \(\mu \|x-x ^{(k)} \| ^{2}\) term on RHS
</li>
<li>
called a `trust region term';
</li>
<li>
first (original) part says to minimize sum of squares for <i>model</i>
</li>
<li>
trust region term says `but don't go far from where you are now'
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>
Could also linearize without calculus; works really well 
<ul>
<li>
See `particle filter'
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-6_7" class="outline-3">
<h3 id="sec-6_7"><span class="section-number-3">6.7</span> G-N example </h3>
<div class="outline-text-3" id="text-6_7">

<ul>
<li>
Nice graph and residual plot
</li>
<li>
As practical matter, good to run simulation several times (with different initial guesses)
</li>
<li>
`exuastive simulation'
</li>
</ul>


</div>

</div>

<div id="outline-container-6_8" class="outline-3">
<h3 id="sec-6_8"><span class="section-number-3">6.8</span> Underdetermined linear equations </h3>
<div class="outline-text-3" id="text-6_8">

<ul>
<li>
\(A \in \mathbb{R}^{m \times n}, m&lt;n\) (\(A\) is fat)
</li>
<li>
more variables than equations
</li>
<li>
\(x\) is underspecified
</li>
<li>
For this sectian <b>assume \(A\) is full rank</b>
</li>
<li>
Set of all solutions has form \(\{x | Ax=y\} = \{x_p + z | z \in \mathcal{N}(A) \}\)
</li>
<li>
solution has dim \(\mathcal{N}(A)= n-m\) `degrees of freedom'
<ul>
<li>
many DOF: good for design (flexibility), bad for estimation (stuff you don't/can't know with available measurements)
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-6_9" class="outline-3">
<h3 id="sec-6_9"><span class="section-number-3">6.9</span> Least norm solution </h3>
<div class="outline-text-3" id="text-6_9">

<ul>
<li>
\fbox{$x <sub>ls</sub> = A <sup>T</sup> (AA <sup>T</sup>) <sup>-1</sup> y$}
<ul>
<li>
similar to our familiar skinny \(A\) version: \(x _{ls} = (A^{T} A) ^{-1} A ^{T} y\)
</li>
<li>
mnemonic: \((\cdot) ^{-1}\) thing must be square
<ul>
<li>
if \(A\) skinny, both $A A <sup>T</sup> and $ \(A^TA\) could be square (syntactically)
</li>
<li>
semantically, you need the up and down patterns that will form the smallest square, i.e., full rank matrix
</li>
</ul>
</li>
</ul>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Lecture 9 pt 2 </h2>
<div class="outline-text-2" id="text-7">

<p>Thank you fucking Suncheon.
</p>
</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> General norm minimization with equality constraints </h3>
<div class="outline-text-3" id="text-7_1">

<ul>
<li>
Problem: \fbox{minimize \(\|A x-b\|\) subject to \(Cx=d\), with variable $x$}
</li>
<li>
Least squares/least norm are special cases
<ul>
<li>
Least norm: set \(A=I, b=0\), then you just have norm of \(x\) subject to some linear equations
</li>
</ul>
</li>
<li>
Same as: minimize \((1/2) \|Ax-b\| ^{2}\) subject to \(Cx=d\)
</li>
<li>
Lagrangian is&hellip;long ugly thing&hellip;look at notes
<ul>
<li>
a bit easier to look at block matrix format
</li>
</ul>
</li>
</ul>




$$
\begin{bmatrix}
  A ^{T} A & C ^{T} \\
  C        & 0      \\
\end{bmatrix}
\begin{bmatrix}
  x       \\
  \lambda \\
\end{bmatrix}
=
\begin{bmatrix}
  A ^{T} b \\
  d        \\
\end{bmatrix}
$$
<ul>
<li>
recover least squares (maybe) by eliminating \(C\) from matrix (not setting to zero, but only having 1 row/column in first matrix)
</li>
</ul>


</div>

</div>

<div id="outline-container-7_2" class="outline-3">
<h3 id="sec-7_2"><span class="section-number-3">7.2</span> Autonomous linear dynamical systems </h3>
<div class="outline-text-3" id="text-7_2">

<p>``What the class is nominally about''
</p><ul>
<li>
In continuous time, autonomous LDS has form \(\dot x = Ax\)
</li>
<li>
Solution: \(x(t) = e ^{ta} x(0)\)
</li>
<li>
\(x(t) \in \mathbb{R}^{n}\) is called the state
<ul>
<li>
\(n\) is state dimension
</li>
</ul>
</li>
<li>
\(A\) basically maps where you are (\(x\)) to where you're going (\(\dot x\))
<ul>
<li>
has units of s\(^{-1}\), frequency
</li>
</ul>
</li>
<li>
Example illustration: vector fields
</li>
</ul>


</div>

</div>

<div id="outline-container-7_3" class="outline-3">
<h3 id="sec-7_3"><span class="section-number-3">7.3</span> Block diagrams </h3>
<div class="outline-text-3" id="text-7_3">

<ul>
<li>
use integrators to express \(\dot x =Ax\) instead of differentiators
<ul>
<li>
block called `bank of integrators'
</li>
<li>
historically used because of analog, mechanical computers
</li>
</ul>
</li>
<li>
notches to express \(n\) signals
</li>
</ul>


</div>

</div>

<div id="outline-container-7_4" class="outline-3">
<h3 id="sec-7_4"><span class="section-number-3">7.4</span> Linear circuit example </h3>
<div class="outline-text-3" id="text-7_4">

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Lecture 10 </h2>
<div class="outline-text-2" id="text-8">

<p>Examples of autonomous linear dynamical systems, \(\dot x = Ax\) 
</p>
</div>

<div id="outline-container-8_1" class="outline-3">
<h3 id="sec-8_1"><span class="section-number-3">8.1</span> Example: Series reaction \(A \rightarrow B \rightarrow C\) </h3>
<div class="outline-text-3" id="text-8_1">


$$
\dot x=
\begin{bmatrix}
  -k_1 & 0    & 0 \\
  k_1  & -k_2 & 0 \\
  0    & k_2  & 0 \\
\end{bmatrix}
x
$$
<ul>
<li>
For second row, first term on rhs of \(\dot x_2 = k_1 x_1 - k_2 x_1\) is <i>buildup</i>
</li>
<li>
Note: Column sums are 0 implies conservation of mass/materials;
</li>
</ul>


</div>

</div>

<div id="outline-container-8_2" class="outline-3">
<h3 id="sec-8_2"><span class="section-number-3">8.2</span> Discrete time Markov chain </h3>
<div class="outline-text-3" id="text-8_2">

<ul>
<li>
\(x(t+1) = Ax(t)\)
</li>
<li>
\(x(t) = A ^{t} x(0)\)
</li>
<li>
Given current state, the matrix of <i>transition probabilities</i> \(P\) will tell you probabilities of the next state, given the current state
</li>
</ul>


</div>

</div>

<div id="outline-container-8_3" class="outline-3">
<h3 id="sec-8_3"><span class="section-number-3">8.3</span> Numerical integration of continuous system </h3>
<div class="outline-text-3" id="text-8_3">

<ul>
<li>
for a small time step \(h\), find about where you'll be in \(h\) seconds b
</li>
<li>
\(x(t+h) \approx x(t) + h \dot x(t) = (I + hA) x(t)\)
</li>
<li>
problem: when you do it for a long time, error can build up pretty high
</li>
</ul>


</div>

</div>

<div id="outline-container-8_4" class="outline-3">
<h3 id="sec-8_4"><span class="section-number-3">8.4</span> Higher order linear dynamical systems (\(\dot x=Ax\)) </h3>
<div class="outline-text-3" id="text-8_4">


\(x ^{(k)} = A _{k-1} x ^{(k-1)} + \cdots + A _{1} x ^{(1)} + A _{0} x, x(t) \in \mathbb{R}^{n}\)
<ul>
<li>
define new variable
</li>
</ul>




$$
z =
\begin{bmatrix}
  x          \\
  x ^{(1)}   \\
  \vdots     \\
  x ^{(k-1)} \\
\end{bmatrix}
\in \mathbb{R}^{nk},
\dot z =
\begin{bmatrix}
  x ^{(1)}   \\
  \vdots     \\
  x ^{(k)} \\
\end{bmatrix}
=
\begin{bmatrix}
       0 &   I &   0 & \cdots & 0        \\
       0 &   0 &   I & \cdots & 0        \\
  \vdots &     &     &        & \vdots   \\
       0 &   0 &   0 & \cdots & I        \\
     A_0 & A_1 & A_2 & \cdots & A _{k-1} \\
\end{bmatrix}
z
$$
<ul>
<li>
`upshift \(x\), and zero-pad'
</li>
<li>
\(z\) is the state, not \(x\)
</li>
<li>
in notes, black diagram with chain of integrators
</li>
</ul>


</div>

</div>

<div id="outline-container-8_5" class="outline-3">
<h3 id="sec-8_5"><span class="section-number-3">8.5</span> Example: Mechanical systems </h3>
<div class="outline-text-3" id="text-8_5">

<ul>
<li>
Ex: \(K _{12}\) is `cross-stiffness', how much stiffness you'd feel at node 1 from node 2
</li>
</ul>


</div>

</div>

<div id="outline-container-8_6" class="outline-3">
<h3 id="sec-8_6"><span class="section-number-3">8.6</span> Linearization near equilibrium point </h3>
<div class="outline-text-3" id="text-8_6">

<p>Equilibrium point corresponds to constant solution (\(f(x_e)= 0, x(t)=x_e\))
</p><ul>
<li>
if you start at an equilibrium point, you'll stay there
</li>
<li>
if you start <i>near</i> equilibrium point
<ul>
<li>
veer off (unstable)
</li>
<li>
go towards equilibrium (stable)
</li>
<li>
something in between
</li>
</ul>
</li>
<li>
but, you never stay at an unstable equilibrium position, since equation is really \(\dot x = f(x) + w(t)\), where \(w(t)\) is noise
</li>
<li>
Near equilibrium point, \(\dot{\delta x}(t) \approx Df(x_e) \delta x(t)\), where \(D\) is the Jacobian
<ul>
<li>
similar to euler forward equation
</li>
</ul>
</li>
<li>
Don't fully trust approximations on approximations (but hope they work)
</li>
</ul>


</div>

</div>
