lin-dyn-sys-stanford.html

<div id="outline-container-8_7" class="outline-3">
<h3 id="sec-8_7"><span class="section-number-3">8.7</span> Example: pendulum linearization </h3>
<div class="outline-text-3" id="text-8_7">

<ul>
<li>
\(ml ^{2} \ddot{\theta}=-lmg \sin \theta\)
</li>
<li>
rewrite as 1st order DE with state \(x=[\theta \text{ } \dot \theta] ^{T} = [x_1 \text{ } x_2] ^{T}\):
</li>
</ul>




$$
\dot x =
\begin{bmatrix}
  x _{2}          \\
  -(g/l) \sin x_1 \\
\end{bmatrix}
$$ 
<ul>
<li>
\(\exists\) equilibrium point at \(x=0\) (and &pi;), so we linearize system near \(x _{e} =0\), using a Jacobian matrix:
</li>
</ul>




$$
\dot{\delta x}=
\begin{bmatrix}
  \frac{\partial x_2}{\partial x_1}               & \frac{\partial x_2}{\partial x_2}               \\
  \frac{\partial}{\partial x_1} \left(-(g/l) \sin x_1 \right)|_{x_1=0} & \frac{\partial}{\partial x_2} (-(g/l) \sin x_1) \\
\end{bmatrix}
\delta x  
=
\begin{bmatrix}
     0 & 1 \\
  -g/l & 0 \\
\end{bmatrix}
\delta x  
$$

</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Lecture 11 </h2>
<div class="outline-text-2" id="text-9">

<p>Solution via Laplace transform and matrix exponential
Remember, we've already overloaded \(\dot x =ax\). Now, we'll overload exponentials to apply to matrices \(x(t) = e ^{ta} x(0)\).
</p>
</div>

<div id="outline-container-9_1" class="outline-3">
<h3 id="sec-9_1"><span class="section-number-3">9.1</span> Laplace transform </h3>
<div class="outline-text-3" id="text-9_1">

<ul>
<li>
\(z: \mathbb{R} _{+} \rightarrow \mathbb{R}^{p\times q}\) (function that maps non-negative real scalars to matrices)
</li>
<li>
Laplace transform: \(Z= \mathcal{L}(z)\), defined by \(\displaystyle Z(s) = \int _{0} ^{\infty} e ^{-st} z(t) dt\)
</li>
<li>
Region of convergence of \(Z\) is mostly for confusing students
</li>
<li>
Derivative property: \(\mathcal{L}(\dot z) = sZ(s)-z(0)\)
</li>
</ul>


<p>
So, we can use the Laplace transform to solve \(\dot x=Ax\). Take Laplace: \(sX(s)-x(0)=AX(s)\), rewrite as \((sI-A)X(s) = x(0)\), so \(X(s) = (sI-A) ^{-1} x(0)\). Then take the inverse transform: \fbox{$x(t) = \mathcal{L} <sup>-1</sup> \left( (sI-A) <sup>-1</sup> \right) x(0)$}
</p><ul>
<li>
takes advantage if linearity of the Laplace transform
</li>
<li>
\((sI-A) ^{-1}\) is called the <i>resolvent</i> of \(A\)
<ul>
<li>
but not defined for eigenvalues of \(A\); \(s\), ST det(\(sI-A\))=0
</li>
</ul>
</li>
<li>
\fbox{\(\Phi = \mathcal{L} ^{-1} ((sI-A) ^{-1} )\) } is called the <i>state-transition matrix</i>, which maps the initial state to state at time \(t\): \fbox{\(x(t) = \Phi(t)x(0)\) }
</li>
</ul>


</div>

</div>

<div id="outline-container-9_2" class="outline-3">
<h3 id="sec-9_2"><span class="section-number-3">9.2</span> Example: Harmonic oscillator </h3>
<div class="outline-text-3" id="text-9_2">


$$
\dot x =
\begin{bmatrix}
   0 & 1 \\
  -1 & 0 \\
\end{bmatrix}
x
$$ 
<ul>
<li>
To solve for \(s\), get the resolvent, then apply the Laplacion to it <i>elementwise</i>, getting
</li>
</ul>




$$
x(t) =
\begin{bmatrix}
  \cos t  & \sin t \\
  -\sin t & \cos t \\
\end{bmatrix}
x(0)
$$
<p>
Which is a circular rotation matrix. The solutions to \(\dot x = ax\) is \(x(t) = e ^{ta} x(0)\)
</p><ul>
<li>
\(a\) positive: exponential growth
</li>
<li>
\(a\) negative: exponential decay
</li>
<li>
\(a=0\): constant
</li>
</ul>


</div>

</div>

<div id="outline-container-9_3" class="outline-3">
<h3 id="sec-9_3"><span class="section-number-3">9.3</span> Example: Double Integrator </h3>
<div class="outline-text-3" id="text-9_3">

<ul>
<li>
Note, with scalars, \(x\) in \(\dot x=ax\) grows exponentially in time, and cannot grow linearly, as with matrices (can have a \(t\) element in matrix)
</li>
<li>
What is first column of \(\Phi(t)\) say? It tells what the state trajectory is if the initial condition was \(e_1\) (second column tells what it is if \(x(0)= e_2\))
</li>
<li>
First row says the linear combination that \(x_1\) is at time \(t\) given \(x(0)\)
</li>
</ul>


</div>

</div>

<div id="outline-container-9_4" class="outline-3">
<h3 id="sec-9_4"><span class="section-number-3">9.4</span> Characteristic polynomial </h3>
<div class="outline-text-3" id="text-9_4">

<p>\(\mathcal X(s) = {\bf det} (sI-A)\); called a <i>monic</i> polynomial
</p><ul>
<li>
roots of \(\mathcal X\) are eigenvalues of \(A\), and \(\mathcal X\) has real coefficients, so e-values are real or occur in conjugate pairs
</li>
</ul>


</div>

</div>

<div id="outline-container-9_5" class="outline-3">
<h3 id="sec-9_5"><span class="section-number-3">9.5</span> Get eigenvalues of \(A\) and poles of resolvent </h3>
<div class="outline-text-3" id="text-9_5">

<p>Use Cramer's rule to get \(i,j\) entry:
$$
(-1) ^{i+j} \frac{\text{det} \Delta _{ij}}{\text{det}(sI-A)},
$$
where \(\Delta _{ij}\) is \(sI-A\) with \(j\) th row and \(i\) th column deleted. Poles of entries of resolvent <b>must</b> be eigenvalues of \(A\).
</p></div>

</div>

<div id="outline-container-9_6" class="outline-3">
<h3 id="sec-9_6"><span class="section-number-3">9.6</span> Matrix exponential </h3>
<div class="outline-text-3" id="text-9_6">

<p>How to overload exponentials for matrices; start with \((I-C) ^{-1}= I + C + C ^{2} +\) &hellip; Series converges if |eigenvalues of \(C\) |&lt;1.
Do series expansion of resolvent, then take the Laplacian of the series, which looks like the form for the expansion of \(e ^{ta}\) (though square matrices replace scalars). So we end by learning that the state transition matrix, \(\Phi(t)\) is the matrix exponential \(e ^{tA}\).
</p><ul>
<li>
Many scalar exponential properties don't extend to matrix exponential; with scalars, this is wrong: \(e ^{A+B} = e ^{A} e ^{B}\) (unless \(A\) and \(B\) commute: \(AB=BA\))
</li>
<li>
But this is ok: \(e ^{-A} = (e ^{A} ) ^{-1}\)
</li>
<li>
So, how do you find the matrix exponential:
</li>
</ul>


<p>
Find \(e^A\),
$$
A=
\begin{bmatrix}
  0 & 1 \\
  0 & 0 \\
\end{bmatrix}
$$ 
Found \(e ^{tA} = \mathcal L ^{-1} (sI-A) ^{-1}\) in earlier example, so just plug in \(t=1\).
</p><ul>
<li>
Matlab: <code>expm(A)</code>, not elementwise <code>exp(A)</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-9_7" class="outline-3">
<h3 id="sec-9_7"><span class="section-number-3">9.7</span> Time transfer property </h3>
<div class="outline-text-3" id="text-9_7">

<p>Summary: for \(\dot x = Ax\), \(x(t) = \Phi (t)x(0) =\) \fbox{$e <sup>tA</sup> x(0)$}. \fbox{The matrix \(e ^{tA}\) propagates initial condition into state at time \(t\).} Also propagates backward in time if \(t&lt;0\).
</p>
<p>
If given \(x(12)\), find \(x(0)\) via \(e ^{-12A} x(12)\).
</p><ul>
<li>
Can use first order forward Euler approximate state update for small \(t\)
</li>
<li>
Discretized autonomous LDS: \(z(k+1) = e ^{hA} z(k)\) (not an approximation for these equations)
</li>
</ul>


</div>

</div>

<div id="outline-container-9_8" class="outline-3">
<h3 id="sec-9_8"><span class="section-number-3">9.8</span> Application: sampling a continuous time system </h3>
<div class="outline-text-3" id="text-9_8">

</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Lecture 12 </h2>
<div class="outline-text-2" id="text-10">

<p>Piecewise constant system: \(A\) is constant for certain intervals of time.
</p><ul>
<li>
Qualitative behavior of \(x(t)\)
<ul>
<li>
Eigenvalues determine (possible) behavior of \(x\)
</li>
<li>
Can plot eigenvalues on complex axes; like pole plot
</li>
<li>
Can put \(x\) in summation form with polynomial coefficient and exponential terms
</li>
</ul>
</li>
</ul>



</div>

<div id="outline-container-10_1" class="outline-3">
<h3 id="sec-10_1"><span class="section-number-3">10.1</span> Stability </h3>
<div class="outline-text-3" id="text-10_1">

<ul>
<li>
\(\dot x=Ax\) is stable if \(e ^{tA} \rightarrow 0\) as \(t \rightarrow \infty\)
<ul>
<li>
means that state \(x(t)\) converges to 0 as \(t \rightarrow \infty\), no matter \(x(0)\)
</li>
<li>
all trajectories of \(\dot x = Ax\) converge to 0 as \(t \rightarrow \infty\)
</li>
<li>
\(\dot x=Ax\) is stable iff all eigenvalues of \(A\) have negative real part
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-10_2" class="outline-3">
<h3 id="sec-10_2"><span class="section-number-3">10.2</span> Eigenvectors and diagonalization </h3>
<div class="outline-text-3" id="text-10_2">

<ul>
<li>
\(\lambda \in \mathbb C\) is an eigenvalue of \(A \in \mathbb C ^{n\times n}\) if (characteristic polynomial)
</li>
</ul>




$$
\mathcal X(\lambda) = \text{det}(\lambda I-A) = 0
$$
<ul>
<li>
i.e., \((\lambda I-A)\) is singular, not invertible, \(\mathcal{N}\) not equal to the 0 set
</li>
</ul>


<p>
Equivalent to:
</p><ul>
<li>
&exist; nonzero \(v \in \mathbb C ^{n}\) s.t. \((\lambda I -A) v = 0\): \fbox{$Av=&lambda; v$} (\(v\) is the eigenvector)
<ul>
<li>
columns are dependent
</li>
</ul>
</li>
<li>
&exist; nonzero \(w \in \mathbb C ^{n}\) s.t. \(w ^{T} (\lambda I -A) = 0\): \fbox{$w<sup>T</sup> A=&lambda; w <sup>T</sup>$} (\(w\) is the <i>left eigenvector</i>)
<ul>
<li>
rows are dependent
</li>
</ul>
</li>
<li>
real \(A\) can still have complex e-pairs
</li>
<li>
\(A,\lambda\) real &rArr; &lambda; is associated with a real \(v\)
</li>
<li>
conjugate (negate imaginary term of complex number[s])
</li>
<li>
hermitian conjugate (and transpose)
</li>
</ul>


</div>

</div>
