lin-dyn-sys-stanford.html

<div id="outline-container-10_3" class="outline-3">
<h3 id="sec-10_3"><span class="section-number-3">10.3</span> Scaling intepretation </h3>
<div class="outline-text-3" id="text-10_3">

<p>\(Av\) is simply scaled version of \(v\) (&lambda; times); all components get magnified by the same amount
</p></div>

</div>

<div id="outline-container-10_4" class="outline-3">
<h3 id="sec-10_4"><span class="section-number-3">10.4</span> Dynamic intepretation </h3>
<div class="outline-text-3" id="text-10_4">

<p>For \(Av=\lambda v\), if \(\dot x= Ax,x(0)=v\) &rArr; \fbox{$x(t) = e <sup>&lambda; t</sup> v$} \(= e ^{tA} v\).
</p><ul>
<li>
\(A ^{2} v = \lambda ^{2} v\)
</li>
<li>
So you just need a scalar in front of the \(v\) to calculate \(x(t)!\)
</li>
<li>
\fbox{An eigenvector is an initial condition \(x(0)\) for which the entire trajectory is really simple.}
</li>
<li>
solution \(x(t) = e ^{\lambda t} v\) is a mode of \(\dot x=Ax\) (associated with eigenvalue &lambda;)
</li>
</ul>


</div>

</div>

<div id="outline-container-10_5" class="outline-3">
<h3 id="sec-10_5"><span class="section-number-3">10.5</span> Invariant set </h3>
<div class="outline-text-3" id="text-10_5">

<p>a set \(S \subseteq \mathbb{R}^{n}\) is <i>invariant</i> under \(\dot x = Ax\) if whenever \(x(t) \in S\), then \(x(\tau) \in S\) for all \(\tau \ge t\) (you stay stuck within the set)
</p><ul>
<li>
vector field intepretation: trajectories only cut <i>into</i> \(S\)
</li>
</ul>


<p>
If a single point is an invariant set, it must be in the nullspace; \(S=\{x_0\} \Leftrightarrow x_0 \in \mathcal{N}(A)\), so \(Ax_0=0=\dot x\).
</p><ul>
<li>
line \(\{tv | t \in \mathbb{R}\}\) is invariant for eigenvector \(v\)
</li>
</ul>


</div>

</div>

<div id="outline-container-10_6" class="outline-3">
<h3 id="sec-10_6"><span class="section-number-3">10.6</span> Complex eigenvectors </h3>
<div class="outline-text-3" id="text-10_6">

<ul>
<li>
for \(a \in \mathbb C\), complex trajectory \(a e ^{\lambda t} v\) satisfies \(\dot x = Ax\), as well as <i>real</i> part
</li>
</ul>




$$
x(t) = \text{Re}(ae ^{\lambda t} v)
$$
$$
= e ^{\sigma t}
\begin{bmatrix}
  v _{re} & v _{im} \\
\end{bmatrix}
\begin{bmatrix}
  \cos \omega t  & \sin \omega t \\
  -\sin \omega t & \cos \omega t \\
\end{bmatrix}
\begin{bmatrix}
  \alpha \\
  -\beta \\
\end{bmatrix}
$$ 
<p>
where
$$
v= v _{re} + jv _{im} , \lambda = \sigma + j \omega, a = \alpha + j \beta
$$ 
</p><ul>
<li>
&sigma; gives logarithmic growth/decay factor
</li>
<li>
&omega; gives angular velocity of rotation in plane
</li>
<li>
trajectory stays in <i>invariant plane</i> span \(\{v _{re} ,v _{im}\}\)
</li>
</ul>


</div>

</div>

<div id="outline-container-10_7" class="outline-3">
<h3 id="sec-10_7"><span class="section-number-3">10.7</span> Dynamic interpretation: left eigenvectors </h3>
<div class="outline-text-3" id="text-10_7">

</div>

</div>

<div id="outline-container-10_8" class="outline-3">
<h3 id="sec-10_8"><span class="section-number-3">10.8</span> Summary: </h3>
<div class="outline-text-3" id="text-10_8">

<ul>
<li>
<i>right eigenvectors</i> are initial conditions from which resulting motion is simple (i.e., remains on line or in plane)
</li>
<li>
<i>left eigenvectors</i> give linear functions of state that are simple, for any initial condition
</li>
</ul>


</div>

</div>

<div id="outline-container-10_9" class="outline-3">
<h3 id="sec-10_9"><span class="section-number-3">10.9</span> Example- companion matrix </h3>
<div class="outline-text-3" id="text-10_9">

<ul>
<li>
Easy to get the characteristic polynomial
</li>
<li>
General truth: with these matrices you can't generally tell the system behavior by just looking at it
</li>
<li>
If you push a signal through an integrator, it gets less wiggly
</li>
<li>
By multiplying by the left eigenvector, you've filtered out the sinusoid?
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Lecture 13 </h2>
<div class="outline-text-2" id="text-11">


</div>

<div id="outline-container-11_1" class="outline-3">
<h3 id="sec-11_1"><span class="section-number-3">11.1</span> Example: Markov chain </h3>
<div class="outline-text-3" id="text-11_1">

<p>Probability vector \(p \in \mathbb{R}^{n}\) that you're in each of \(n\) states: \(p(t+1)=Pp(t)\). This probability evolves in time by being multiplied by state transition matrix \(P\).
</p><ul>
<li>
\(p _{i} (t)= {\bf Prob} (z(t)=i) \Rightarrow \sum ^{n} _{i=1} p _{i} (t) =1\) 
</li>
<li>
sum of each column is 1
<ul>
<li>
called stochastic
</li>
</ul>
</li>
<li>
i.e., \([1\text{ }1\text{ } \cdots 1]\) is a left eigenvector of \(P\) with \(\lambda = 1\)
</li>
<li>
so det(\(I-P\))=0, so there's also a nonzero right eigenvector s.t. \(Pv=v\)
<ul>
<li>
\(v\) can always be chosen to have non-negative elements, and can be normalized
</li>
</ul>
</li>
<li>
<b>Interpretation</b>: \(v\) is an equilibrium distribution; you don't change your <i>probability</i> distribution in time; always in \(v\) 
<ul>
<li>
if \(v\) unique, it's called the steady-state distribution of the Markov chain
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-11_2" class="outline-3">
<h3 id="sec-11_2"><span class="section-number-3">11.2</span> Diagonalization </h3>
<div class="outline-text-3" id="text-11_2">

<ul>
<li>
\(v_1,...,v_n\) is LI set of eigenvectors of \(A \in \mathbb{R}^{n\times n}\): \(Av_i=\lambda_i v_i\)
</li>
<li>
Concatenate in matrix language:
</li>
</ul>




$$
A
\begin{bmatrix}
  v_1 & \cdots & v_n \\
\end{bmatrix}
=
\begin{bmatrix}
  v_1 & \cdots & v_n \\
\end{bmatrix}
\begin{bmatrix}
  \lambda_1 &           &        &           \\
            & \lambda_2 &        &           \\
            &           & \ddots &           \\
            &           &        & \lambda_n \\
\end{bmatrix}
$$
<p>
or, \(AT=T\Lambda\), or \(T ^{-1} AT=\Lambda\)
</p><ul>
<li>
note, \(T\) is invertible, since its columns are linearly independent
</li>
<li>
This is why, while \(Av=\lambda v\) is more commonly used for a scalar eigenvalue, \fbox{$Av=v&lambda;$} is more general, as it can represent a vector of eigenvalues &lambda;.
</li>
<li>
so, \(A\) is diagonalizable if
<ul>
<li>
&exist; \(T\) s.t. \(T ^{-1} AT=\Lambda\) is diagonal
</li>
<li>
\(A\) has a set of linearly independent eigenvectors
<ul>
<li>
if \(A\) not diagonalizable, it is called defective
</li>
</ul>
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-11_3" class="outline-3">
<h3 id="sec-11_3"><span class="section-number-3">11.3</span> Not all matrices diagonalizable </h3>
<div class="outline-text-3" id="text-11_3">

<p>i.e.,
$$
A=
\begin{bmatrix}
  0 & 1 \\
  0 & 0 \\
\end{bmatrix}
$$ 
</p></div>

</div>

<div id="outline-container-11_4" class="outline-3">
<h3 id="sec-11_4"><span class="section-number-3">11.4</span> Distinct eigenvalues </h3>
<div class="outline-text-3" id="text-11_4">

<p><b>fact</b>: distinct eigenvalues in \(A\) &rArr; \(A\) diagonalizable
</p><ul>
<li>
converse not true, i.e., \(I \in \mathbb{R}^{7\times 7}\)
</li>
</ul>


</div>

</div>

<div id="outline-container-11_5" class="outline-3">
<h3 id="sec-11_5"><span class="section-number-3">11.5</span> Diagonalization and left eigenvectors </h3>
<div class="outline-text-3" id="text-11_5">

<p>rewrite \(T ^{-1} AT = \Lambda\) as \(T ^{-1} A = \Lambda T ^{-1}\):
$$ 
\begin{bmatrix}
  w ^{T} _1 \\
  \vdots    \\
  w ^{T} _n \\
\end{bmatrix}
A=\Lambda
\begin{bmatrix}
  w ^{T} _1 \\
  \vdots    \\
  w ^{T} _n \\
\end{bmatrix}
$$
</p><ul>
<li>
remember that &Lambda; is diagonal matrix, and multiplying by a diagonal matrix on the left is equivalent to scaling rows of the matrix
<ul>
<li>
on the right scales the columns
</li>
</ul>
</li>
</ul>


<p>
Remeber left/right multiplication results (whether it scales columns or rows) with \(2 \times 2\) matrix multiplication:
$$
\begin{bmatrix}
    2 &   0 \\
    0 &   3 \\
\end{bmatrix}
\begin{bmatrix}
  x_1 & x_2 \\
  y_1 & y_2 \\
\end{bmatrix}
=
\begin{bmatrix}
  2x_1 & 2x_2 \\
  3y_1 & 3y_2 \\
\end{bmatrix}
$$
I.e., right multiplication of diagonal matrix scales the rows.
</p><ul>
<li>
Take LI set of eigenvectors as columns, invert that matrix, then the rows are <b>left</b> eigenvectors
</li>
<li>
An eigenvector is still an eigenvector after being scaled; so any can be normalized
</li>
</ul>


</div>

</div>

<div id="outline-container-11_6" class="outline-3">
<h3 id="sec-11_6"><span class="section-number-3">11.6</span> Modal form </h3>
<div class="outline-text-3" id="text-11_6">

<p>Take a LI set of eigenvectors from \(A\), shove them together as columns of new matrix \(T\) = ``\(A\) is diagonalizable by \(T\)''
</p><ul>
<li>
can define new coordinates by \(x=T \tilde x\):
</li>
<li>
\(\tilde x\) is coordinates of \(x\) in the \(T\) expansion; modal (or eigenvector) expansion
<ul>
<li>
\(\tilde x\) is \(x\) in terms of the eigenvectors
</li>
</ul>
</li>
</ul>




$$
T \dot{\tilde x}=AT \tilde x \Leftrightarrow \dot{ \tilde x}= T ^{-1} AT \tilde x \Leftrightarrow \dot{ \tilde x} = \Lambda \tilde x
$$
<ul>
<li>
in new coordinate system, system is diagonal (decoupled)
</li>
<li>
normally, with \(\dot x=Ax\), there's a ton of cross-gains from input \(x_i\) to output \(y_j\), where all the outputs depend on all the inputs (assuming \(A\) has only non-zero entries)
<ul>
<li>
diagonalized system decouples it; trajectory consists of \(n\) independent modes:
</li>
</ul>
</li>
</ul>




$$
\tilde x_i (t) = e ^{\lambda_i t} \tilde x _{i} (0)
$$
</div>

</div>
