lin-dyn-sys-stanford.html

<div id="outline-container-11_7" class="outline-3">
<h3 id="sec-11_7"><span class="section-number-3">11.7</span> Real modal form </h3>
<div class="outline-text-3" id="text-11_7">

<p>when eigenvalues (&rArr; \(T\)) are complex
</p><ul>
<li>
notes show block diagram of complex mode (note if real parts &sigma; are removed, you get harmonic oscillator)
</li>
</ul>


</div>

</div>

<div id="outline-container-11_8" class="outline-3">
<h3 id="sec-11_8"><span class="section-number-3">11.8</span> Diagonalization simplification </h3>
<div class="outline-text-3" id="text-11_8">

<p>Simplifies calculation of:
</p><ul>
<li>
resolvent
</li>
<li>
powers (\(A^k\))
</li>
<li>
exponential (\(e ^{A}=T {\bf diag} (e ^{\lambda_1},\dots, e ^{\lambda_n}) T ^{-1}\))
</li>
<li>
So, diagonalization is largely a conceptual tool, and sometimes gives great computational advantage
</li>
</ul>


</div>

</div>

<div id="outline-container-11_9" class="outline-3">
<h3 id="sec-11_9"><span class="section-number-3">11.9</span> Simplify for analytical functions of a matrix </h3>
<div class="outline-text-3" id="text-11_9">

</div>

</div>

<div id="outline-container-11_10" class="outline-3">
<h3 id="sec-11_10"><span class="section-number-3">11.10</span> Solution via diagonalization </h3>
<div class="outline-text-3" id="text-11_10">

<p>\(\dot x=Ax\) solution is \(x(t)=e ^{tA} x(0)\)
</p><ul>
<li>
with diagonalization, solution given as
</li>
</ul>




$$
x(t) = \sum ^{n} _{i=1} e ^{\lambda_i t} (w_i ^{T} x(0))v_i
$$ 
</div>

</div>

<div id="outline-container-11_11" class="outline-3">
<h3 id="sec-11_11"><span class="section-number-3">11.11</span> Interpretation </h3>
<div class="outline-text-3" id="text-11_11">

<ul>
<li>
(left eigenvectors) decompose initial state \(x(0)\) into modal components \(w ^{T} _{i} x(0)\)
</li>
<li>
\(e ^{\lambda_i t}\) term propagates \(i\) th mode forward \(t\) seconds
</li>
<li>
reconstruct state as linear combination of (right eigenvectors)
</li>
</ul>


</div>

</div>

<div id="outline-container-11_12" class="outline-3">
<h3 id="sec-11_12"><span class="section-number-3">11.12</span> Application </h3>
<div class="outline-text-3" id="text-11_12">

<p>Finding \(x(0)\) that gives stable solution.
</p></div>

</div>

<div id="outline-container-11_13" class="outline-3">
<h3 id="sec-11_13"><span class="section-number-3">11.13</span> Stability of discrete-time systems </h3>
<div class="outline-text-3" id="text-11_13">

<ul>
<li>
powers of complex numbers \(s^k\) go to zero if \(|s|&lt;1\)
<ul>
<li>
imaginary part tells how much of a rotation at each step you get
</li>
</ul>
</li>
<li>
\fbox{\(x(t+1) = Ax(t)\) is stable iff all eigenvalues of \(A\) have magnitude less than one}
</li>
<li>
spectral radius of \(A:\rho (A)= {\bf max} |\lambda _i |\)
<ul>
<li>
so it is a stable system iff \(\rho(A)&lt;1\)
</li>
<li>
&rho; gives rough growth or decay
</li>
</ul>
</li>
</ul>


</div>

</div>

<div id="outline-container-11_14" class="outline-3">
<h3 id="sec-11_14"><span class="section-number-3">11.14</span> Jordan Canonical form </h3>
<div class="outline-text-3" id="text-11_14">

<ul>
<li>
<i>Any</i> matrix \(A \in \mathbb{R}^{n\times n}\) can be expressed in Jordan-canonical form (via `similarity transformation,' for some invertible matrix \(T ^{-1}\))
</li>
</ul>




$$
T ^{-1} AT=J=
\begin{bmatrix}
  J_1 &        &     \\
      & \ddots &     \\
      &        & J_q \\
\end{bmatrix}
$$ 
<p>
where
$$
J_i =
\begin{bmatrix}
  \lambda_i &         1 &        &           \\
            & \lambda_i & \ddots &           \\
            &           & \ddots &         1 \\
            &           &        & \lambda_i \\
\end{bmatrix}
\in \mathbb C ^{n_i \times n_i}
$$ 
</p><ul>
<li>
\(J\) is `upper bidiagonal'
</li>
<li>
Jordan form is unique (up to permutations of blocks- blocks might be in different places in the diagonal)
</li>
<li>
<i>Almost</i> strictly a conceptual tool; almost never used for numerical computations
</li>
<li>
Jordan forms are inutil if the matrix is already diagonalizable
</li>
<li>
When you get into Jordan form, you can use a chain of integrators to represent it in block diagram form
</li>
<li>
Jordan blocks refer to dynamics blocks that cannot be decoupled
</li>
<li>
Jordan blocks yield:
<ul>
<li>
repeated poles in resolvent
</li>
<li>
terms of form \(t ^{p} e ^{t\lambda}\) in \(e ^{tA}\)

</li>
</ul>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Appendix </h2>
<div class="outline-text-2" id="text-12">

<p>Some special things to remember.
</p>
</div>

<div id="outline-container-12_1" class="outline-3">
<h3 id="sec-12_1"><span class="section-number-3">12.1</span> Inverse, transpose properties </h3>
<div class="outline-text-3" id="text-12_1">

<ul>
<li>
\((AB) ^{-1} = B ^{-1} A ^{-1}\)
</li>
<li>
\((A ^{-1}) ^{T} = (A ^{T}) ^{-1}= A ^{-T}\) 
</li>
</ul>


</div>

</div>

<div id="outline-container-12_2" class="outline-3">
<h3 id="sec-12_2"><span class="section-number-3">12.2</span> Invertibility implications </h3>
<div class="outline-text-3" id="text-12_2">

<p>For an \(n\)-by-\(n\) matrix \(A\) 
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Invertible</th><th scope="col" class="left">mnemonic</th></tr>
</thead>
<tbody>
<tr><td class="left">\(\vert A\vert \ne 0\)</td><td class="left">\(\vert A\vert = 0\) &rArr; you can't compute the inverse</td></tr>
<tr><td class="left"></td><td class="left">- (remember base case 2 &times; 2 matrix inverse involves \(1/\vert A\vert\) term)</td></tr>
<tr><td class="left">non-singular</td><td class="left">singular &rArr; the matrix sends a nontrivial subspace to the singular subspace, \{0\}</td></tr>
<tr><td class="left">\(A\) is full rank</td><td class="left">linearly independent columns (invertibility &rArr; 1-to-1/injective)</td></tr>
<tr><td class="left">\(\mathcal{N}(A)=\{0\}\)</td><td class="left">linearly independent columns</td></tr>
<tr><td class="left">\(\mathcal R (A)= \mathbb{R}^{n}\)</td><td class="left">linearly independent columns</td></tr>
<tr><td class="left">\(Ax=b\) has unique solution for every \(b\)</td><td class="left">- no more than one solution (can't add members of \(\mathcal N (A)\) for multiple \(b\))</td></tr>
<tr><td class="left"></td><td class="left">- one solution, since \(\mathcal R (A)= \mathbb{R}^{n}\); everything reachable/surjective</td></tr>
<tr><td class="left"></td><td class="left">- one solution found using the unique inverse of <i>A</i></td></tr>
<tr><td class="left">rref(\(A)=I_n\)</td><td class="left"></td></tr>
<tr><td class="left">\(A\) is a product of elementary matrices</td><td class="left"></td></tr>
</tbody>
</table>


</div>
</div>

</div>
